StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
/*
 * This structure is queued to worker thread to process all the receive events occurred before socket context is created for accepted client socket.
 */
typedef struct cy_socket_recv_events
{
    uint32_t recv_count;
    cy_socket_ctx_t *socket;
} cy_socket_recv_event_t;

typedef struct cy_socket_multicast_pair
{
  cy_socket_ctx_t       *socket;         /**< Socket */
  cy_socket_ip_address_t if_addr;        /**< Interface IP address */
  cy_socket_ip_address_t multi_addr;     /**< multicast group address */
} cy_socket_multicast_pair_t;

/* Used to keep track of the registered multicast members */
typedef struct cy_socket_multicast_info
{
    cy_socket_multicast_pair_t *multicast_member_list;      /**< List of multicast addresses registered */
    uint32_t                    multicast_member_status;    /**< Each bit in this member indicates status of corresponding entry in multicast_member_list. */
    uint8_t                     multicast_member_count;     /**< Number of multicast addresses registered */
} cy_socket_multicast_info_t;

static cy_socket_multicast_info_t multicast_info;

/* Mutex to protect the multicast info */
static cy_mutex_t multicast_join_leave_mutex;

typedef enum
{
    SOCKET_STATUS_FLAG_CONNECTED = 0x1, /* TCP socket connection is established with peer */
    SOCKET_STATUS_FLAG_SECURED   = 0x2, /* Secure TLS connection is establisher with peer */
    SOCKET_STATUS_FLAG_LISTENING = 0x4  /* Server socket is ready for client connections */
} cy_socket_status_flag_t;

/*
 * Following macros are used to find disconnect and receive events occurred before the socket context is created for accepted client sockets.
 */
#define SECURE_SOCKETS_DISCONNET_EVENT_BIT_MASK (1 << 30)
#define SECURE_SOCKETS_RECEIVE_EVENT_BIT_MASK   (1 << 31)

#define SECURE_SOCKETS_MAX_FRAG_LEN_NONE    0
#define SECURE_SOCKETS_MAX_FRAG_LEN_512     1
#define SECURE_SOCKETS_MAX_FRAG_LEN_1024    2
#define SECURE_SOCKETS_MAX_FRAG_LEN_2048    3
#define SECURE_SOCKETS_MAX_FRAG_LEN_4096    4
#define SECURE_SOCKETS_MAX_FRAG_LEN_INVALID 5

/* Secure sockets thread stack size */
#ifndef SECURE_SOCKETS_THREAD_STACKSIZE
#define SECURE_SOCKETS_THREAD_STACKSIZE    (6 * 1024)
#endif

/* Sleep time in each loop while waiting for ARP resolution */
#define ARP_CACHE_CHECK_INTERVAL_IN_MSEC    5

#define NUM_SOCKETS                         MEMP_NUM_NETCONN

#define SECURE_SOCKETS_MAGIC_HEADER         0xbaefdcbd
#define SECURE_SOCKETS_MAGIC_FOOTER         0xefbcabfe

/* Maximum number of multicast groups supported. */
#define SECURE_SOCKETS_MAX_MULTICAST_GROUPS 10

#define UNUSED_ARG(arg)                     (void)(arg)

#define LWIP_TO_CY_SECURE_SOCKETS_ERR( lwip_err )   ( lwip_to_secure_socket_error(lwip_err) )
#define TLS_TO_CY_SECURE_SOCKETS_ERR( tls_err )     ( tls_to_secure_socket_error(tls_err) )

#ifdef ENABLE_SECURE_SOCKETS_LOGS
#define ss_cy_log_msg cy_log_msg
#else
#define ss_cy_log_msg(a,b,c,...)
#endif

typedef struct cy_lwip_sock
{
    int used;
    cy_socket_ctx_t *ctx;
}cy_lwip_sock_t;

/** mutex to protect socket array */
static cy_mutex_t socket_list_mutex;

static cy_mutex_t netconn_recvfrom_mutex;

/* mutex to protect the counter maintained for receive events occurred
 * on an accepted socket, prior to socket context is created for it.
 */
static cy_mutex_t accept_recv_event_mutex;
static cy_worker_thread_info_t socket_worker;

/* Socket library usage count */
static int init_ref_count = 0;

/** The global array of available sockets */
static cy_lwip_sock_t socket_list[NUM_SOCKETS];

/* Function used to get bytes available after decryption from underlying security stack */
extern uint32_t cy_tls_get_bytes_avail(void *context);

static bool is_socket_valid(cy_socket_ctx_t* socket)
{
    if((socket->socket_magic_header == SECURE_SOCKETS_MAGIC_HEADER) && (socket->socket_magic_footer == SECURE_SOCKETS_MAGIC_FOOTER))
    {
        return true;
    }
    return false;
}
static cy_rslt_t convert_lwip_to_secure_socket_ip_addr(cy_socket_ip_address_t *dest, const ip_addr_t *src)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    memset(dest, 0, sizeof(cy_socket_ip_address_t));

/* If both LWIP_IPV6 and LWIP_IPV4 are enabled, then ip_addr_t has its own structure definition.
 * If only LWIP_IPV4 is enabled ip_addr_t is a typedef to ip4_addr_t, if only LWIP_IPV6 is enabled
 * ip_addr_t is a typedef to ip6_addr_t.
 */
#if LWIP_IPV6 && LWIP_IPV4
    if(src->type == IPADDR_TYPE_V4)
    {
        dest->ip.v4 = src->u_addr.ip4.addr;
        dest->version = CY_SOCKET_IP_VER_V4;
    }
    else if(src->type == IPADDR_TYPE_V6)
    {
        dest->version= CY_SOCKET_IP_VER_V6;
        dest->ip.v6[0] = src->u_addr.ip6.addr[0];
        dest->ip.v6[1] = src->u_addr.ip6.addr[1];
        dest->ip.v6[2] = src->u_addr.ip6.addr[2];
        dest->ip.v6[3] = src->u_addr.ip6.addr[3];
    }
    else
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid IP version type \r\n");
        result = CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }
#else

#if LWIP_IPV4
    dest->ip.v4 = src->addr;
    dest->version = CY_SOCKET_IP_VER_V4;
#elif LWIP_IPV6
    dest->ip.v6[0] = src->addr[0];
    dest->ip.v6[1] = src->addr[1];
    dest->ip.v6[2] = src->addr[2];
    dest->ip.v6[3] = src->addr[3];
    dest->version= CY_SOCKET_IP_VER_V6;
#else
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "LWIP_IPV6 and LWIP_IPV4 both are disabled \r\n");
    result = CY_RSLT_MODULE_SECURE_SOCKETS_BAD_NW_STACK_CONFIGURATION;
#endif

#endif

    return result;
}

static cy_rslt_t convert_secure_socket_to_lwip_ip_addr(ip_addr_t *dest, const cy_socket_ip_address_t *src)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    memset(dest, 0, sizeof(ip_addr_t));

#if LWIP_IPV6 && LWIP_IPV4
    if(src->version == CY_SOCKET_IP_VER_V4)
    {
        ip_addr_set_ip4_u32(dest, src->ip.v4);
        dest->type = IPADDR_TYPE_V4;
    }
    else
    {
        dest->u_addr.ip6.addr[0] = src->ip.v6[0];
        dest->u_addr.ip6.addr[1] = src->ip.v6[1];
        dest->u_addr.ip6.addr[2] = src->ip.v6[2];
        dest->u_addr.ip6.addr[3] = src->ip.v6[3];
        dest->type = IPADDR_TYPE_V6;
    }
#else

