StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
#if LWIP_IPV4
    if(src->version == CY_SOCKET_IP_VER_V4)
    {
        ip_addr_set_ip4_u32(dest, src->ip.v4);
    }
    else
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "not an IPv4 address \r\n");
        result = CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }
#elif LWIP_IPV6
    if(src->version == CY_SOCKET_IP_VER_V6)
    {
        dest->addr[0] = src->ip.v6[0];
        dest->addr[1] = src->ip.v6[1];
        dest->addr[2] = src->ip.v6[2];
        dest->addr[3] = src->ip.v6[3];
    }
    else
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "not an IPv6 address \r\n");
        result = CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }
#else
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "LWIP_IPV6 and LWIP_IPV4 both are disabled \r\n");
    result = CY_RSLT_MODULE_SECURE_SOCKETS_BAD_NW_STACK_CONFIGURATION;
#endif /* LWIP_IPV6 */

#endif /* LWIP_IPV6 && LWIP_IPV4 */
    return result;
}

/* Find the index of the next registered slot in the multicast list. Caller should ensure to call
 * this helper function only when at-least one member is registered, else the while will become indefinite.
 * This function should be called under a mutex lock. */
static uint32_t next_registered_multicast_slot(uint32_t index)
{
    while(!(multicast_info.multicast_member_status & (0x0001 << index)))
    {
        index++;
    }
    return index;
}

/* Find the index of the next free slot in the multicast list. Ensure to call this function only when the
 * total registered count is not reached the maximum. This function should be called under a mutex lock. */
static uint32_t next_free_multicast_slot(uint32_t index)
{
    while(multicast_info.multicast_member_status & (0x0001 << index))
    {
        index++;
    }
    return index;
}

/* Set the status of the given input slot in the multicast list. This function should be called under a mutex lock. */
static void set_multicast_slot_status_bit(uint32_t index)
{
    multicast_info.multicast_member_status |= (0x0001 << index);
}

/* Clear the status of the given input slot in the multicast list. This function should be called under a mutex lock. */
static void clear_multicast_slot_status_bit(uint32_t index)
{
    multicast_info.multicast_member_status &= ~(0x0001 << index);
}

/* Find the index of the given input member in the multicast list. */
static int find_multicast_member_index(cy_socket_ctx_t *socket, const cy_socket_ip_mreq_t *imr)
{
    uint32_t count = 0;
    uint32_t index = 0;

    while(count < multicast_info.multicast_member_count)
    {
        index = next_registered_multicast_slot(index);

        if( memcmp(&multicast_info.multicast_member_list[index].multi_addr, &imr->multi_addr, sizeof(imr->multi_addr)) == 0 &&
            memcmp(&multicast_info.multicast_member_list[index].if_addr, &imr->if_addr, sizeof(imr->if_addr)) == 0 &&
            multicast_info.multicast_member_list[index].socket == socket )
        {
            return index;
        }
        count++;
        index++;
    }

    return -1;
}

static cy_socket_ctx_t* alloc_socket()
{
    int i;
    cy_rslt_t result;

    /* allocate a new socket identifier */
    for(i = 0; i < NUM_SOCKETS; ++i)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex locked %s %d\r\n", __FILE__, __LINE__);
        cy_rtos_get_mutex(&socket_list_mutex, CY_RTOS_NEVER_TIMEOUT);
        if(!socket_list[i].ctx)
        {
            if(socket_list[i].used)
            {
                cy_rtos_set_mutex(&socket_list_mutex);
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\r\n", __FILE__, __LINE__);
                continue;
            }
            socket_list[i].ctx = malloc(sizeof(cy_socket_ctx_t));
            if( socket_list[i].ctx == NULL)
            {
                cy_rtos_set_mutex(&socket_list_mutex);
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\r\n", __FILE__, __LINE__);
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "malloc failed %s %d\r\n", __FILE__, __LINE__);
                return NULL;
            }

            memset(socket_list[i].ctx, 0, sizeof(cy_socket_ctx_t));

            result = cy_rtos_init_mutex(&socket_list[i].ctx->netconn_mutex);
            if(CY_RSLT_SUCCESS != result)
            {
                free(socket_list[i].ctx);
                socket_list[i].ctx = NULL;

                cy_rtos_set_mutex(&socket_list_mutex);
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\r\n", __FILE__, __LINE__);

                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_rtos_init_mutex failed at file: %s line: %d error code: %ld\r\n", __FILE__, __LINE__, result);
                return NULL;
            }

            result = cy_rtos_init_mutex(&socket_list[i].ctx->socket_mutex);
            if(CY_RSLT_SUCCESS != result)
            {
                cy_rtos_deinit_mutex(&socket_list[i].ctx->netconn_mutex);

                free(socket_list[i].ctx);
                socket_list[i].ctx = NULL;

                cy_rtos_set_mutex(&socket_list_mutex);
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\r\n", __FILE__, __LINE__);

                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_rtos_init_mutex failed at file: %s line: %d error code: %ld\r\n", __FILE__, __LINE__, result);
                return NULL;
            }

            socket_list[i].used = 1;
            socket_list[i].ctx->id = i;
#if defined(CYBSP_ETHERNET_CAPABLE)
            socket_list[i].ctx->iface_type = CY_SOCKET_ETH1_INTERFACE;
            socket_list[i].ctx->iface_idx = 1;
#else
            /* Default interface for Wi-Fi will be STA interface */
            extern int global_iface;
            socket_list[i].ctx->iface_type = global_iface;
            socket_list[i].ctx->iface_idx = 0;
#endif
            socket_list[i].ctx->socket_magic_header = SECURE_SOCKETS_MAGIC_HEADER;
            socket_list[i].ctx->socket_magic_footer = SECURE_SOCKETS_MAGIC_FOOTER;

            cy_rtos_set_mutex(&socket_list_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\r\n", __FILE__, __LINE__);
            return socket_list[i].ctx;
        }
        else
        {
            cy_rtos_set_mutex(&socket_list_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\r\n", __FILE__, __LINE__);
        }
    }
    return NULL;
}

static void free_socket(cy_socket_ctx_t* socket)
{
    int id;

    if(socket == NULL)
    {
        return;
    }

