StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
    id = socket->id;
    if(id >= 0 && id < NUM_SOCKETS)
    {
        /* update the sockets array */
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex locked %s %d\r\n", __FILE__, __LINE__);
        cy_rtos_get_mutex(&socket_list_mutex, CY_RTOS_NEVER_TIMEOUT);
        cy_rtos_deinit_mutex(&socket->netconn_mutex);
        cy_rtos_deinit_mutex(&socket->socket_mutex);
        socket_list[id].used = 0;
        memset(socket_list[id].ctx, 0, sizeof(cy_socket_ctx_t));
        socket_list[id].ctx = NULL;
        cy_rtos_set_mutex(&socket_list_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\r\n", __FILE__, __LINE__);
    }

    /* free the socket memory */
    free(socket);
}

static unsigned char max_fragment_length_to_mfl_code(uint32_t max_fragment_length)
{
    unsigned char mfl;
    switch(max_fragment_length)
    {
        case 0:
        {
            mfl = SECURE_SOCKETS_MAX_FRAG_LEN_NONE;
            break;
        }
        case 512:
        {
            mfl = SECURE_SOCKETS_MAX_FRAG_LEN_512;
            break;
        }
        case 1024:
        {
            mfl = SECURE_SOCKETS_MAX_FRAG_LEN_1024;
            break;
        }
        case 2048:
        {
            mfl = SECURE_SOCKETS_MAX_FRAG_LEN_2048;
            break;
        }
        case 4096:
        {
            mfl = SECURE_SOCKETS_MAX_FRAG_LEN_4096;
            break;
        }
        default:
        {
            mfl = SECURE_SOCKETS_MAX_FRAG_LEN_INVALID;
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid maximum fragment length \r\n");
        }
    }
    return mfl;
}

static uint32_t mfl_code_to_max_fragment_length(unsigned char mfl_code)
{
    uint32_t max_fragment_length=0;;

    switch(mfl_code)
    {
        case SECURE_SOCKETS_MAX_FRAG_LEN_NONE:
        {
            max_fragment_length = 0;
            break;
        }
        case SECURE_SOCKETS_MAX_FRAG_LEN_512:
        {
            max_fragment_length = 512;
            break;
        }
        case SECURE_SOCKETS_MAX_FRAG_LEN_1024:
        {
            max_fragment_length = 1024;
            break;
        }
        case SECURE_SOCKETS_MAX_FRAG_LEN_2048:
        {
            max_fragment_length = 2048;
            break;
        }
        case SECURE_SOCKETS_MAX_FRAG_LEN_4096:
        {
            max_fragment_length = 4096;
            break;
        }
        default:
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid mflcode %d \r\n", mfl_code);
        }
    }
    return max_fragment_length;
}

static cy_rslt_t lwip_to_secure_socket_error(err_t error)
{
    switch(error)
    {
        case ERR_OK:
            return CY_RSLT_SUCCESS;

        case ERR_CLSD:
            return CY_RSLT_MODULE_SECURE_SOCKETS_CLOSED;

        case ERR_MEM:
            return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;

        case ERR_TIMEOUT:
            return CY_RSLT_MODULE_SECURE_SOCKETS_TIMEOUT;

        case ERR_INPROGRESS:
        case ERR_ALREADY:
            return CY_RSLT_MODULE_SECURE_SOCKETS_IN_PROGRESS;

        case ERR_ISCONN:
            return CY_RSLT_MODULE_SECURE_SOCKETS_ALREADY_CONNECTED;

        case ERR_CONN:
        case ERR_ABRT:
        case ERR_RST:
            return CY_RSLT_MODULE_SECURE_SOCKETS_NOT_CONNECTED;

        case ERR_ARG:
        case ERR_VAL:
            return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;

        case ERR_USE:
            return CY_RSLT_MODULE_SECURE_SOCKETS_ADDRESS_IN_USE;

        case ERR_RTE:
            return CY_RSLT_MODULE_SECURE_SOCKETS_ERROR_ROUTING;

        case ERR_WOULDBLOCK:
            return CY_RSLT_MODULE_SECURE_SOCKETS_WOULDBLOCK;

        case ERR_BUF:
        case ERR_IF:
        default:
            return CY_RSLT_MODULE_SECURE_SOCKETS_TCPIP_ERROR;
    }
}

static cy_rslt_t tls_to_secure_socket_error(cy_rslt_t error)
{
    switch(error)
    {
        case CY_RSLT_SUCCESS:
            return CY_RSLT_SUCCESS;

        case CY_RSLT_MODULE_TLS_BADARG:
            return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;

        case CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE:
            return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;

        case CY_RSLT_MODULE_TLS_CONNECTION_CLOSED:
            return CY_RSLT_MODULE_SECURE_SOCKETS_CLOSED;

        case CY_RSLT_MODULE_TLS_SOCKET_NOT_CONNECTED:
            return CY_RSLT_MODULE_SECURE_SOCKETS_NOT_CONNECTED;

        case CY_RSLT_MODULE_TLS_TIMEOUT:
            return CY_RSLT_MODULE_SECURE_SOCKETS_TIMEOUT;

        case CY_RSLT_MODULE_TLS_PKCS_ERROR:
            return CY_RSLT_MODULE_SECURE_SOCKETS_PKCS_ERROR;

        case CY_RSLT_MODULE_TLS_PARSE_CERTIFICATE:
        case CY_RSLT_MODULE_TLS_PARSE_KEY:
        case CY_RSLT_MODULE_TLS_ERROR:
        default:
            return CY_RSLT_MODULE_SECURE_SOCKETS_TLS_ERROR;
    }
}

static cy_rslt_t secure_socket_to_tls_error(cy_rslt_t error)
{
    switch(error)
    {
        case CY_RSLT_SUCCESS:
            return CY_RSLT_SUCCESS;

        case CY_RSLT_MODULE_SECURE_SOCKETS_BADARG:
            return CY_RSLT_MODULE_TLS_BADARG;

        case CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM:
            return CY_RSLT_MODULE_TLS_OUT_OF_HEAP_SPACE;

        case CY_RSLT_MODULE_SECURE_SOCKETS_CLOSED:
            return CY_RSLT_MODULE_TLS_CONNECTION_CLOSED;

        case CY_RSLT_MODULE_SECURE_SOCKETS_TIMEOUT:
            return CY_RSLT_MODULE_TLS_TIMEOUT;

        case CY_RSLT_MODULE_SECURE_SOCKETS_NOT_CONNECTED:
            return CY_RSLT_MODULE_TLS_SOCKET_NOT_CONNECTED;

        default:
            return CY_RSLT_MODULE_TLS_ERROR;
    }
}
#if LWIP_IPV4
/* This function checks if the MAC address is present in ARP cache table for the given IP. If not, it triggers
 * ARP request and wait for the MAC address to be resolved for the given IP address. If it's resolved within
 * the timeout value it returns success and cy_socket_sendto function sends the datagram packet. If not, the function returns
 * error and cy_socket_sendto function also returns error to the caller.
 *
 * NOTE: The LwIP stack drops the datagram packet if the entry doesn't exist in ARP Cache table for the given IP address.
 */
/*-----------------------------------------------------------*/
static cy_rslt_t eth_arp_resolve(ip4_addr_t *dest_addr, cy_socket_interface_t iface_type)
{
    ssize_t arp_index = -1;
    struct netif *netif;
    const ip4_addr_t *ipv4addr;
    struct eth_addr *eth_ret = NULL;
    const ip4_addr_t *ip_ret = NULL;
    int32_t arp_waittime = ARP_WAIT_TIME_IN_MSEC;
    err_t err;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "eth_arp_resolve Start\r\n");

    if(iface_type != CY_SOCKET_STA_INTERFACE  && iface_type != CY_SOCKET_AP_INTERFACE && iface_type != CY_SOCKET_ETH0_INTERFACE && iface_type != CY_SOCKET_ETH1_INTERFACE)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid interface type \r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    if(iface_type == CY_SOCKET_STA_INTERFACE)
    {
        netif = cy_network_get_nw_interface(CY_NETWORK_WIFI_STA_INTERFACE, 0);
    }
    else if(iface_type == CY_SOCKET_AP_INTERFACE)
    {
        netif = cy_network_get_nw_interface(CY_NETWORK_WIFI_AP_INTERFACE, 0);
    }
    else if(iface_type == CY_SOCKET_ETH0_INTERFACE)
    {
        netif = cy_network_get_nw_interface(CY_NETWORK_ETH_INTERFACE, 0);
    }
    else
    {
        netif = cy_network_get_nw_interface(CY_NETWORK_ETH_INTERFACE, 1);
    }

    ipv4addr = dest_addr;
    if(netif == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_network_get_nw_interface returned NULL \r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_NETIF_DOES_NOT_EXIST;
    }

    /* No need to resolve the ARP for broadcasts and multicasts addresses.  */
    if( (ip4_addr_isbroadcast(ipv4addr, netif)) || (ip4_addr_ismulticast(ipv4addr)) )
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "eth_arp_resolve broadcast or multicast packet\r\n");
        return CY_RSLT_SUCCESS;
    }

