StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
    /* Check if the destination address is outside subnet. */
    if(!ip4_addr_netcmp(ipv4addr, netif_ip4_addr(netif), netif_ip4_netmask(netif)) && !ip4_addr_islinklocal(ipv4addr))
    {
        /* Check if default gateway address is available */
        if (!ip4_addr_isany_val(*netif_ip4_gw(netif)))
        {
            /* send to hardware address of default gateway IP address */
            ipv4addr = netif_ip4_gw(netif);
        }
        else
        {
            /* no default gateway available */
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "default gateway missing \r\n");
            return lwip_to_secure_socket_error(ERR_RTE);
        }
    }

    /* Check if entry for the address is already present in the ARP cache. */
    arp_index = etharp_find_addr(netif, ipv4addr, &eth_ret, &ip_ret);
    if(arp_index == -1)
    {
        /* Entry for the address is not present in the ARP cache. Sent ARP request.*/
        err = etharp_request(netif, ipv4addr);
        if(err != ERR_OK)
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "etharp_request failed with error %d\n", err);
            return  LWIP_TO_CY_SECURE_SOCKETS_ERR(err);
        }

        do
        {
            arp_index = etharp_find_addr(netif, ipv4addr, &eth_ret, (const ip4_addr_t **) &ip_ret);
            if(arp_index != -1)
            {
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "arp entry found \r\n");
                break;
            }
            cy_rtos_delay_milliseconds(ARP_CACHE_CHECK_INTERVAL_IN_MSEC);
            arp_waittime -= ARP_CACHE_CHECK_INTERVAL_IN_MSEC;
            if(arp_waittime <= 0)
            {
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Could not resolve MAC address for the given destination address \r\n");
                return CY_RSLT_MODULE_SECURE_SOCKETS_ARP_TIMEOUT;
            }
        } while(1);
    }

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "eth_arp_resolve End\r\n");
    return CY_RSLT_SUCCESS;
}
#endif

/*-----------------------------------------------------------*/
static void cy_process_receive_event_with_valid_context(cy_socket_ctx_t *ctx)
{
    int recv_avail = 0;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_process_receive_event_with_valid_context Start \r\n");

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex locked %s %d\r\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&accept_recv_event_mutex, CY_RTOS_NEVER_TIMEOUT);

    if(ctx->transport_protocol == CY_SOCKET_IPPROTO_UDP)
    {
        if(ctx->callbacks.receive.callback)
        {
            /* For UDP transport protocol, check  conn_handler->recv_avail to find if receive data is available. */
            SYS_ARCH_GET(ctx->conn_handler->recv_avail, recv_avail);

            if(recv_avail > 0)
            {
                ctx->callbacks.receive.callback((cy_socket_t)ctx, ctx->callbacks.receive.arg);
            }
        }
        else
        {
            /* Receive Callback is not registered yet. Increment the receive count so that it will processed as soon the receive callback is registered. */
            ctx->recv_events_cache++;
        }
    }
    else if( ( !ctx->enforce_tls && ( ctx->status & SOCKET_STATUS_FLAG_CONNECTED) ==  SOCKET_STATUS_FLAG_CONNECTED ) ||
             ( ( ctx->status & SOCKET_STATUS_FLAG_SECURED) ==  SOCKET_STATUS_FLAG_SECURED) )
    {
        /* If the transport protocol is TCP or TLS invoke application's receive callback function only if the connection is established.
         * The above check is needed for TLS connection so that we do not invoke app's receive callback for TLS handshake messages.
         */
        if(ctx->callbacks.receive.callback)
        {
            SYS_ARCH_GET(ctx->conn_handler->recv_avail, recv_avail);

            if(recv_avail > 0)
            {
                ctx->callbacks.receive.callback((cy_socket_t)ctx, ctx->callbacks.receive.arg);
            }
            else
            {
                /* LwIP receive event and conn->recv_avail are packet based, but secure socket APIs are stream based.
                 * If conn->recv_avail is zero, still there can be received data left in the pbuf that is stored in
                 * the socket context. In that case even though conn->rec_avail is zero application callback need be be invoked.
                 */
                struct pbuf *pbuf = NULL;
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "netconn_mutex locked %s %d\n", __FILE__, __LINE__);
                cy_rtos_get_mutex(&ctx->netconn_mutex, CY_RTOS_NEVER_TIMEOUT);
                pbuf = ctx->buf;
                cy_rtos_set_mutex(&ctx->netconn_mutex);
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "netconn_mutex unlocked %s %d\n", __FILE__, __LINE__);
                if(pbuf)
                {
                    ctx->callbacks.receive.callback((cy_socket_t)ctx, ctx->callbacks.receive.arg);
                }
                /* Problem: Currently, LWIP sends event to application/library for each packet received from the network, if data from the packet is not yet consumed. 
                 * In secure connection, when a TLS record is fragmented over multiple LWIP packets, if the first read call from application to security stack, reads all 
                 * the LWIP packets for that TLS record then data is consumed from the packet. Hence LWIP doesn't send any more event to application and due to which the 
                 * application doesnt receive full data.
                 *
                 * Solution: Added ctx->data_received to keep track of data read in security stack. If there are no more packets with LWIP, then check if the security stack
                 * has received/read some data. If either one of layer has the packet then send an event to application/library which will eventually read the data.
                 */
                else if( ctx->enforce_tls )
                {
                    if( ctx->data_received )
                    {
                        ctx->callbacks.receive.callback((cy_socket_t)ctx, ctx->callbacks.receive.arg);
                    }
                }
            }
        }
        else
        {
            /* Receive Callback is not registered yet. Increment the receive count so that it will processed as soon the receive callback is registered. */
            ctx->recv_events_cache++;
        }
    }
    cy_rtos_set_mutex(&accept_recv_event_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex unlocked %s %d\r\n", __FILE__, __LINE__);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_process_receive_event_with_valid_context End \r\n");
}
/*-----------------------------------------------------------*/
static void cy_process_receive_event(void *arg)
{
    struct netconn *conn = (struct netconn *)arg;
    int id;
    cy_socket_ctx_t *ctx = NULL;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_process_receive_event Start \r\n");
    if(NETCONNTYPE_GROUP(netconn_type(conn)) == NETCONN_TCP)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex locked %s %d\r\n", __FILE__, __LINE__);
        cy_rtos_get_mutex(&accept_recv_event_mutex, CY_RTOS_NEVER_TIMEOUT);

