StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
        /*
         * 1. On netconn creation lwIP initializes conn->socket value to -1. cy_socket_accept function changes conn->socket value to socket ID once it creates context for the accepted client socket.
         * 2. To keep-track of receive events occurred prior to socket context is created, conn->socket variable's bit fields are utilized in following way.
         *
         *    +------------------------------+------+-------
              |bit-32| bit-31  |           bits1-30        |
              +------------------------------+------+-------

              bit  32 : This bit is set to one on the first receive event that occurred prior to socket context is created.
              bit  31 : This bit is set to on on the disconnect event occurred prior to socket context is created.
              bits 1-30 : Holds number of receive events occurred before socket context is created.
         */
        /* Check if socket context is created for the accepted client socket. */
        if(conn->socket == -1)
        {
            /* Set the receive event bit */
            conn->socket = SECURE_SOCKETS_RECEIVE_EVENT_BIT_MASK;

            /* Increment the receive event count. */
            conn->socket++;

            cy_rtos_set_mutex(&accept_recv_event_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex unlocked %s %d\r\n", __FILE__, __LINE__);

            return;
        }
        else if(conn->socket & SECURE_SOCKETS_RECEIVE_EVENT_BIT_MASK)
        {
            /* Increment the receive event count. */
            conn->socket++;

            cy_rtos_set_mutex(&accept_recv_event_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex unlocked %s %d\r\n", __FILE__, __LINE__);
            return;
        }
        else
        {
            /*
             * This else condition hits when conn->socket value is not -1 and receive event bit is not set, that means socket context is allocated for accepted client socket.
             * So we can get the socket id from conn->socket.
             */
            id = conn->socket;
        }

        cy_rtos_set_mutex(&accept_recv_event_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex unlocked %s %d\r\n", __FILE__, __LINE__);
    }
    else
    {
        id = conn->socket;
    }
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex locked %s %d\r\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&socket_list_mutex, CY_RTOS_NEVER_TIMEOUT);
    ctx = (cy_socket_ctx_t *)socket_list[id].ctx;

    if(ctx == NULL)
    {
        cy_rtos_set_mutex(&socket_list_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\r\n", __FILE__, __LINE__);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "context is NULL in cy_process_receive_event \r\n");
        return;
    }

    cy_process_receive_event_with_valid_context(ctx);

    cy_rtos_set_mutex(&socket_list_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\r\n", __FILE__, __LINE__);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_process_receive_event End \r\n");
}

/*-----------------------------------------------------------*/
/*
 * This function processes the receive events occurred before socket context is created for the accepted client socket.
 */
static void cy_process_pending_receive_events(void *arg)
{
    cy_socket_recv_event_t *recv_event = (cy_socket_recv_event_t *)arg;
    cy_socket_ctx_t *ctx;
    uint32_t count;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_process_pending_receive_events Start\r\n");
    if(recv_event == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Argument to the worker thread callback function is NULL\r\n");
        return;
    }

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex locked %s %d\r\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&socket_list_mutex, CY_RTOS_NEVER_TIMEOUT);

    ctx = recv_event->socket;
    count = recv_event->recv_count;

    if(ctx == NULL || count == 0)
    {
        cy_rtos_set_mutex(&socket_list_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\r\n", __FILE__, __LINE__);

        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_process_pending_receive_events End\r\n");
        free(recv_event);
        return;
    }

    /* Application might have deleted the socket while we are processing the pending receive events. So check if the socket is valid. */
    if(is_socket_valid(ctx))
    {
        if(ctx->callbacks.receive.callback == NULL)
        {
            cy_rtos_set_mutex(&socket_list_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\r\n", __FILE__, __LINE__);

            /* This if condition should never be true, as this event is pushed to queue only after the receive callback is registered. */
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_process_pending_receive_events receive callback is not registered\r\n");
            free(recv_event);
            return;
        }

        while(count)
        {
            cy_process_receive_event_with_valid_context(ctx);
            count--;
        }
    }

    cy_rtos_set_mutex(&socket_list_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\r\n", __FILE__, __LINE__);

    free(recv_event);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_process_pending_receive_events End\r\n");
    return;
}

/*-----------------------------------------------------------*/
static void cy_process_connect_event(cy_socket_ctx_t *ctx)
{
    if(ctx == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "context is NULL in cy_process_connect_event \r\n");
        return;
    }

    if(ctx->callbacks.connect_request.callback)
    {
        ctx->callbacks.connect_request.callback((cy_socket_t)ctx, ctx->callbacks.connect_request.arg);
    }
}
/*-----------------------------------------------------------*/
static void cy_process_disconnect_event(cy_socket_ctx_t *ctx)
{
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_process_disconnect_event Start\r\n");
    if(ctx == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "context is NULL in cy_process_disconnect_event \r\n");
        return;
    }

    if(ctx->callbacks.disconnect.callback)
    {
        ctx->callbacks.disconnect.callback((cy_socket_t)ctx, ctx->callbacks.disconnect.arg);
    }

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_process_disconnect_event End\r\n");
}
/*-----------------------------------------------------------*/
static void cy_process_connect_disconnect_notification_event(void *arg)
{
    struct netconn *conn = (struct netconn *)arg;
    cy_socket_ctx_t *socket_ctx;
    int socket_id;

