StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_process_connect_disconnect_notification_event Start\r\n");

    cy_rtos_get_mutex(&accept_recv_event_mutex, CY_RTOS_NEVER_TIMEOUT);

    socket_id = conn->socket;


    /*
     * 1. Connect event occurs on server socket and not on accepted client socket. So for connect event conn->socket value always have the valid socket ID.
     * 2. conn->socket == -1 means, disconnect event occurred before socket context is created for accepted client socket. This can happen if the remote client does connect and disconnect immediately.
     * 3. To keep track of the disconnect event and the receive events occcurred before socket context is created, conn->socket variable's bit fields are used in following way.
     *
     *        +------------------------------+------+-------
              |bit-32| bit-31  |           bits1-30        |
              +------------------------------+------+-------

              bit  32 : This bit is set to one on the first receive event that occurred prior to socket context is created.
              bit  31 : This bit is set to on on the disconnect event occurred prior to socket context is created.
              bits 1-30 : Holds number of receive events occurred before socket context is created.
     */

    /* Check if socket context is created for accepted client socket. */
    if(socket_id == -1)
    {
        conn->socket = SECURE_SOCKETS_DISCONNET_EVENT_BIT_MASK;

        cy_rtos_set_mutex(&accept_recv_event_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return;
    }
    /* Check if any receive events occurred before socket context is created for accepted client socket.*/
    else if(socket_id & SECURE_SOCKETS_RECEIVE_EVENT_BIT_MASK)
    {
        /*
         * Receive events occurred before socket context is created, so set the disconnect event bit without clearing receive event bit.
         */
        conn->socket |= SECURE_SOCKETS_DISCONNET_EVENT_BIT_MASK;

        cy_rtos_set_mutex(&accept_recv_event_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return;
    }

    cy_rtos_set_mutex(&accept_recv_event_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex unlocked %s %d\n", __FILE__, __LINE__);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex locked %s %d\r\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&socket_list_mutex, CY_RTOS_NEVER_TIMEOUT);
    socket_ctx = (cy_socket_ctx_t *)socket_list[socket_id].ctx;

    /* By the time worker function is scheduled for disconnect event, application might have deleted the socket.
     * In that case socket_ctx will be NULL. So do NULL check for socket_ctx before accessing it.
     */
    if( socket_ctx == NULL )
    {
        cy_rtos_set_mutex(&socket_list_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\r\n", __FILE__, __LINE__);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Callback function invoked on a deleted socket \r\n");
        return;
    }

    /* Connect event occurs on server socket's conn handler */
    if((socket_ctx->status & SOCKET_STATUS_FLAG_LISTENING) ==  SOCKET_STATUS_FLAG_LISTENING)
    {
        cy_process_connect_event(socket_ctx);
    }
    else if((socket_ctx->status & SOCKET_STATUS_FLAG_CONNECTED) ==  SOCKET_STATUS_FLAG_CONNECTED)
    {
        /* Disconnect event occurs on client or accepted socket's conn handler */
        cy_process_disconnect_event(socket_ctx);
    }

    cy_rtos_set_mutex(&socket_list_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\r\n", __FILE__, __LINE__);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_process_connect_disconnect_notification_event End\r\n");
}
/*-----------------------------------------------------------*/
static void cy_process_send_plus_event(void *arg)
{

    cy_socket_ctx_t *socket_ctx;
    int socket_id = (int)arg;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_process_send_plus_event Start\r\n");
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex locked %s %d\r\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&socket_list_mutex, CY_RTOS_NEVER_TIMEOUT);
    socket_ctx = (cy_socket_ctx_t *)socket_list[socket_id].ctx;
    if(socket_ctx == NULL)
    {
        cy_rtos_set_mutex(&socket_list_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\r\n", __FILE__, __LINE__);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "context is NULL in cy_process_disconnect_event \r\n");
        return;
    }
    socket_ctx->send_events = 1;
    cy_rtos_set_mutex(&socket_list_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\r\n", __FILE__, __LINE__);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_process_send_plus_event End\r\n");
}
/*-----------------------------------------------------------*/
static void cy_process_send_minus_event(void *arg)
{
    struct netconn *conn = (struct netconn *)arg;
    cy_socket_ctx_t *socket_ctx;
    int socket_id;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_process_send_minus_event Start\r\n");
    socket_id = conn->socket;
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex locked %s %d\r\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&socket_list_mutex, CY_RTOS_NEVER_TIMEOUT);
    socket_ctx = (cy_socket_ctx_t *)socket_list[socket_id].ctx;
    if(socket_ctx == NULL)
    {
        cy_rtos_set_mutex(&socket_list_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\r\n", __FILE__, __LINE__);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "context is NULL in cy_process_send_minus_event \r\n");
        return;
    }

    socket_ctx->send_events = 0;
    cy_rtos_set_mutex(&socket_list_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_list_mutex unlocked %s %d\r\n", __FILE__, __LINE__);

