StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_process_send_minus_event End\r\n");
}
/*-----------------------------------------------------------*/
static void internal_netconn_event_callback(struct netconn *conn, enum netconn_evt event, u16_t length)
{
    cy_rslt_t result;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "internal_netconn_event_callback conn %p event %d length %d\r\n",conn, event, length);
    if(conn)
    {
        switch(event)
        {
            case NETCONN_EVT_RCVPLUS:
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "NETCONN_EVT_RCVPLUS %s %d\r\n", __FILE__, __LINE__);
                if(length > 0)
                {
                    result = cy_worker_thread_enqueue(&socket_worker, cy_process_receive_event, (void *)conn);
                    if(result != CY_RSLT_SUCCESS)
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_defer_work failed at file: %s line: %d with error: 0x%lx\r\n", __FILE__, __LINE__, result);
                    }
                }
                else
                {
                    /* NETCONN_EVT_RCVPLUS with length zero is  connect/disconnect notification */
                    result = cy_worker_thread_enqueue(&socket_worker, cy_process_connect_disconnect_notification_event, (void *)conn);
                    if(result != CY_RSLT_SUCCESS)
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_defer_work failed at file: %s line: %d with error: 0x%lx\r\n", __FILE__, __LINE__, result);
                    }
                }
                break;

            case NETCONN_EVT_RCVMINUS:
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "NETCONN_EVT_RCVMINUS %s %d\r\n", __FILE__, __LINE__);
                break;

            case NETCONN_EVT_SENDPLUS:
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "NETCONN_EVT_SENDPLUS %s %d\r\n", __FILE__, __LINE__);

                /* NETCONN_EVT_SENDPLUS with length zero indicate connection deletion and connection established
                 * Non zero length indicates data has been sent to remote peer and received by it. */
                result = cy_worker_thread_enqueue(&socket_worker, cy_process_send_plus_event, (void *)conn->socket);
                if(result != CY_RSLT_SUCCESS)
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_defer_work failed at file: %s line: %d with error: 0x%lx\r\n", __FILE__, __LINE__, result);

                }
                break;

            case NETCONN_EVT_SENDMINUS:
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "NETCONN_EVT_SENDMINUS %s %d\r\n", __FILE__, __LINE__);
                result = cy_worker_thread_enqueue(&socket_worker, cy_process_send_minus_event, (void *)conn);
                if(result != CY_RSLT_SUCCESS)
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_defer_work failed at file: %s line: %d with error: 0x%lx\r\n", __FILE__, __LINE__, result);
                }
                break;

            default:
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "unknown event %d\r\n", event);
                break;
        }
    }
    return;
}
/*-----------------------------------------------------------*/
/*
 * @brief Network send helper function. Function call to this function should be protected by netconn_mutex.
 */
static cy_rslt_t network_send(void *context, const unsigned char *data_buffer, uint32_t data_buffer_length, uint32_t *bytes_sent)
{
    err_t ret ;
    cy_socket_ctx_t *ctx = (cy_socket_ctx_t *)context;

    *bytes_sent = 0;

    /* Call wifi-mw-core network activity function to resume the network stack. */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    ret = netconn_write_partly(ctx->conn_handler, data_buffer, data_buffer_length, 0, (size_t *)bytes_sent);
    if(ret != ERR_OK)
    {
        *bytes_sent = 0;
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "netconn_write_partly failed with error %d\n", ret);
        return  LWIP_TO_CY_SECURE_SOCKETS_ERR(ret) ;
    }

    return CY_RSLT_SUCCESS;
}
/*-----------------------------------------------------------*/
/*
 * @brief TLS network send callback.
 */
static cy_rslt_t tls_network_send_callback(void *context, const unsigned char *data_buffer, uint32_t data_buffer_length, uint32_t *bytes_sent)
{
    cy_rslt_t result;

    result = network_send(context, data_buffer, data_buffer_length, bytes_sent);

    return secure_socket_to_tls_error(result);
}
/*-----------------------------------------------------------*/
/*
 * @brief Network receive helper function. Function call to this function should be protected by netconn_mutex.
 */
static cy_rslt_t network_receive(void *context, unsigned char *buffer, uint32_t len, uint32_t *bytes_received)
{
    err_t ret;
    u16_t received;
    size_t total_received = 0;
    size_t toread = 0;
    size_t outoffset = 0;
    struct pbuf *p;
    cy_socket_ctx_t *ctx = (cy_socket_ctx_t *)context;

    *bytes_received = 0;

    /* Call wifi-mw-core network activity function to resume the network stack. */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    do
    {
        if(!ctx->buf)
        {
            ret = netconn_recv_tcp_pbuf(ctx->conn_handler, &p);
            if(ret != ERR_OK)
            {
                /* If some amount of data already received, return success with amount of bytes received, else return error. */
                if(total_received)
                {
                    break;
                }
                else
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "netconn_recv_tcp_pbuf returned %d\n", ret);
                    return LWIP_TO_CY_SECURE_SOCKETS_ERR(ret);
                }
            }

            if(p->tot_len == 0)
            {
                ctx->buf = NULL;
                continue;
            }
            ctx->buf = p;
            ctx->offset = 0;
        }

