StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
        /*
         * This is the data left to read
         */
        toread = len - total_received;
        if(toread > ctx->buf->tot_len - ctx->offset)
        {
            toread = ctx->buf->tot_len - ctx->offset;
        }

        /*
         * Copy the data out
         */
        received = pbuf_copy_partial(ctx->buf, buffer + outoffset, (u16_t)toread, ctx->offset);
        if( ctx->enforce_tls && ( ctx->status & SOCKET_STATUS_FLAG_SECURED) ==  SOCKET_STATUS_FLAG_SECURED )
        {
            ctx->data_received += received;
        }

        ctx->offset += received;

        /*
         * Keep track of the total received
         */
        total_received += received;

        /*
         * Move the output pointer for the output buffer
         */
        outoffset += received;

        /*
         * If we used up the current buffer, mark the context
         * as not having read data.  This will force another network
         * read the next time through the loop
         */
        if(ctx->offset >= ctx->buf->tot_len)
        {
            pbuf_free(ctx->buf);
            ctx->buf = 0;
        }

    }while(total_received < len);

    *bytes_received = total_received;

    return CY_RSLT_SUCCESS;
}
/*-----------------------------------------------------------*/
/*
 * @brief TLS receive callback.
 */
static cy_rslt_t tls_network_receive_callback(void *context, unsigned char *buffer, uint32_t len, uint32_t *bytes_received)
{
    cy_rslt_t result;

    result = network_receive(context, buffer, len, bytes_received);

    return secure_socket_to_tls_error(result);
}
/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_init(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_worker_thread_params_t params;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_init Start\r\n");

    if(!init_ref_count)
    {
        result = cy_rtos_init_mutex(&socket_list_mutex);
        if(CY_RSLT_SUCCESS != result)
        {
            return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
        }

        result = cy_rtos_init_mutex(&accept_recv_event_mutex);
        if(CY_RSLT_SUCCESS != result)
        {
            cy_rtos_deinit_mutex(&socket_list_mutex);
            return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
        }

        result = cy_rtos_init_mutex(&netconn_recvfrom_mutex);
        if(CY_RSLT_SUCCESS != result)
        {
            cy_rtos_deinit_mutex(&socket_list_mutex);
            cy_rtos_deinit_mutex(&accept_recv_event_mutex);
            return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
        }

        memset(&multicast_info, 0 , sizeof(multicast_info));

        result = cy_rtos_init_mutex(&multicast_join_leave_mutex);
        if(CY_RSLT_SUCCESS != result)
        {
            cy_rtos_deinit_mutex(&socket_list_mutex);
            cy_rtos_deinit_mutex(&accept_recv_event_mutex);
            cy_rtos_deinit_mutex(&netconn_recvfrom_mutex);

            return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
        }

        /* Allocate memory for multicast member list. */
        multicast_info.multicast_member_list = (cy_socket_multicast_pair_t *)malloc(sizeof(cy_socket_multicast_pair_t) * SECURE_SOCKETS_MAX_MULTICAST_GROUPS);
        if(multicast_info.multicast_member_list == NULL)
        {
            cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "malloc failed for multicast member list\r\n");
            cy_rtos_deinit_mutex(&socket_list_mutex);
            cy_rtos_deinit_mutex(&accept_recv_event_mutex);
            cy_rtos_deinit_mutex(&netconn_recvfrom_mutex);
            cy_rtos_deinit_mutex(&multicast_join_leave_mutex);
            return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
        }

        memset(&params, 0, sizeof(params));
        params.name = "Socket";
        params.priority = CY_RTOS_PRIORITY_ABOVENORMAL;
        params.stack = NULL;
        params.stack_size = SECURE_SOCKETS_THREAD_STACKSIZE;
        params.num_entries = 0;

        /* create a worker thread */
        result = cy_worker_thread_create(&socket_worker, &params);
        if(result != CY_RSLT_SUCCESS)
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Create Worker Thread returned:0x%lx\r\n", result);
            cy_rtos_deinit_mutex(&socket_list_mutex);
            cy_rtos_deinit_mutex(&accept_recv_event_mutex);
            cy_rtos_deinit_mutex(&netconn_recvfrom_mutex);
            cy_rtos_deinit_mutex(&multicast_join_leave_mutex);
            if(multicast_info.multicast_member_list)
            {
                free(multicast_info.multicast_member_list);
                multicast_info.multicast_member_list = NULL;
            }
            return result;
        }
        /* Initialized the TLS library */
        result = cy_tls_init();
        if(result != CY_RSLT_SUCCESS)
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Create Worker Thread returned:0x%lx\r\n", result);
            cy_rtos_deinit_mutex(&socket_list_mutex);
            cy_rtos_deinit_mutex(&accept_recv_event_mutex);
            cy_rtos_deinit_mutex(&netconn_recvfrom_mutex);
            cy_rtos_deinit_mutex(&multicast_join_leave_mutex);
            if(multicast_info.multicast_member_list)
            {
                free(multicast_info.multicast_member_list);
                multicast_info.multicast_member_list = NULL;
            }
            cy_worker_thread_delete(&socket_worker);
            return result;
        }
        init_ref_count++;
    }
    else
    {
        init_ref_count++;
    }
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_init End\r\n");

    return result;
}
/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_create(int domain, int type, int protocol, cy_socket_t *handle)
{
    cy_socket_ctx_t *ctx = NULL;
    struct netconn  *conn = NULL;
    enum netconn_type conn_type = NETCONN_INVALID;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_create Start\r\n");

    if( handle == NULL )
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "NULL handle\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }
#if LWIP_IPV4 && LWIP_IPV6
    if( (domain != CY_SOCKET_DOMAIN_AF_INET) && (domain != CY_SOCKET_DOMAIN_AF_INET6) )
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid domain\r\n");
        *handle = CY_SOCKET_INVALID_HANDLE;
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }
#else
#if LWIP_IPV4
    if(domain != CY_SOCKET_DOMAIN_AF_INET)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid domain\r\n");
        *handle = CY_SOCKET_INVALID_HANDLE;
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }
#elif LWIP_IPV6
    if(domain != CY_SOCKET_DOMAIN_AF_INET6)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid domain\r\n");
        *handle = CY_SOCKET_INVALID_HANDLE;
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }
#else
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "LWIP_IPV6 and LWIP_IPV4 both are disabled\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_BAD_NW_STACK_CONFIGURATION;
    }
#endif
#endif /* LWIP_IPV4 && LWIP_IPV6 */

    if( !( ( (type == CY_SOCKET_TYPE_STREAM) && (protocol == CY_SOCKET_IPPROTO_TCP || protocol == CY_SOCKET_IPPROTO_TLS) ) ||
           ( (type == CY_SOCKET_TYPE_DGRAM) && (protocol == CY_SOCKET_IPPROTO_UDP) ) ) )
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid type/protocol combination\r\n");
        *handle = CY_SOCKET_INVALID_HANDLE;
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    ctx = alloc_socket();
    if(ctx == NULL)
    {
        *handle = CY_SOCKET_INVALID_HANDLE;
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "alloc_socket failed \r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
    }

    ctx->transport_protocol = protocol;

    if(protocol == CY_SOCKET_IPPROTO_TCP || protocol == CY_SOCKET_IPPROTO_TLS)
    {
        if(domain == CY_SOCKET_DOMAIN_AF_INET)
        {
            conn_type = NETCONN_TCP;
        }
#if LWIP_IPV6
        else
        {
            conn_type = NETCONN_TCP_IPV6;
        }
#endif

