StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
        ctx->is_authmode_set = false;
        if(protocol == CY_SOCKET_IPPROTO_TLS)
        {
            ctx->enforce_tls = true;
            /* Set the default TLS authentication mode to verify required. */
            ctx->auth_mode = CY_SOCKET_TLS_VERIFY_REQUIRED;
        }
    }
    else if(protocol == CY_SOCKET_IPPROTO_UDP)
    {
        if(domain == CY_SOCKET_DOMAIN_AF_INET)
        {
            conn_type = NETCONN_UDP;
        }
#if LWIP_IPV6
        else
        {
            conn_type = NETCONN_UDP_IPV6;
        }
#endif
    }

    /* Call wifi-mw-core network activity function to resume the network stack. */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    conn = netconn_new_with_callback(conn_type, internal_netconn_event_callback);
    if(conn == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "netconn_new_with_callback failed\r\n");
        free_socket(ctx);
        return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
    }

    ctx->conn_handler = conn;
    ctx->conn_handler->socket = ctx->id;

#if LWIP_SO_RCVTIMEO
    ctx->is_recvtimeout_set = false;

    /**
     * Setting the receive timeout is necessary to avoid indefinite blocking while trying
     * to read more bytes than what was actually received.
     */
    netconn_set_recvtimeout(ctx->conn_handler, DEFAULT_RECV_TIMEOUT_IN_MSEC);
#endif

#if LWIP_SO_SNDTIMEO
    ctx->is_sendtimeout_set = false;

    /**
     * Setting the send timeout to default value.
     */
    netconn_set_sendtimeout(ctx->conn_handler, DEFAULT_SEND_TIMEOUT_IN_MSEC);
#endif

    ctx->data_received = 0;
    *handle = ctx;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_create End\r\n");
    return CY_RSLT_SUCCESS;
}
/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_setsockopt(cy_socket_t handle, int level, int optname, const void *optval, uint32_t optlen)
{
    cy_socket_ctx_t *ctx = NULL;
    cy_socket_opt_callback_t *callback_opt;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_setsockopt Start\r\n");
    if(CY_SOCKET_INVALID_HANDLE == handle)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }
    if( ((level < CY_SOCKET_SOL_SOCKET) || (level > CY_SOCKET_SOL_IP)) ||
        ((optval == NULL) && (optname != CY_SOCKET_SO_CONNECT_REQUEST_CALLBACK) && (optname != CY_SOCKET_SO_RECEIVE_CALLBACK) && (optname != CY_SOCKET_SO_DISCONNECT_CALLBACK)) ||
        ((optval != NULL) && (optlen == 0)) )
    {
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    ctx = (cy_socket_ctx_t *) handle;

    if(!is_socket_valid(ctx))
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    /* While this function is running, application may delete the socket. Protect entire function with a mutex. */
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex locked %s %d\r\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&ctx->socket_mutex, CY_RTOS_NEVER_TIMEOUT);

    switch(level)
    {
        case CY_SOCKET_SOL_TLS:
            /* All TLS socket options are used in TLS handshake. So don't allow setting these
             * socket options when socket is in connected state.
             */
            if(ctx->status & SOCKET_STATUS_FLAG_CONNECTED)
            {
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Socket connected\r\n");

                cy_rtos_set_mutex(&ctx->socket_mutex);
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                return CY_RSLT_MODULE_SECURE_SOCKETS_ALREADY_CONNECTED;
            }

            switch(optname)
            {
                case CY_SOCKET_SO_TLS_IDENTITY:
                {
                    ctx->tls_identity = optval;
                    break;
                }
                case CY_SOCKET_SO_TLS_AUTH_MODE:
                {
                    ctx->auth_mode = *((cy_socket_tls_auth_mode_t *)optval);
                    ctx->is_authmode_set = true;
                    break;
                }
                case CY_SOCKET_SO_SERVER_NAME_INDICATION:
                {
                    if(ctx->hostname)
                    {
                        free(ctx->hostname);
                    }
                    ctx->hostname = (char *) malloc(optlen + 1);
                    if(NULL == ctx->hostname)
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "malloc failed for hostname \n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
                    }
                    memcpy(ctx->hostname, optval, optlen);
                    ctx->hostname[ optlen ] = '\0';
                    break;
                }

                case CY_SOCKET_SO_TLS_MFL:
                {
                    uint32_t mfl = *((uint32_t *)optval);
                    ctx->mfl_code = max_fragment_length_to_mfl_code(mfl);
                    if(SECURE_SOCKETS_MAX_FRAG_LEN_INVALID == ctx->mfl_code)
                    {
                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }
                    break;
                }
                case CY_SOCKET_SO_TRUSTED_ROOTCA_CERTIFICATE:
                {
                    if(ctx->rootca_certificate)
                    {
                        /* free the previous configured root_ca if it exists */
                        free(ctx->rootca_certificate);
                    }

                    ctx->rootca_certificate = malloc(optlen + 1);
                    if(NULL == ctx->rootca_certificate)
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "malloc failed for ca_cert \r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
                    }

