StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
                    memset(ctx->rootca_certificate, 0, optlen + 1);
                    memcpy(ctx->rootca_certificate, optval, optlen);
                    ctx->rootca_certificate_len = optlen;
                    break;
                }
                case CY_SOCKET_SO_ALPN_PROTOCOLS:
                {
                    char* ptr = NULL;
                    int count=0;
                    int i = 0;

                    ctx->alpn = malloc(optlen+1);
                    if(NULL == ctx->alpn)
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "malloc failed for alpn \r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
                    }
                    memcpy(ctx->alpn, optval, optlen);

                    ctx->alpn[optlen] = '\0';

                    /* find the number of protcols in the alpn list */
                    ptr = (char *)optval;
                    while(*ptr != '\0')
                    {
                        if( *ptr == ',' )
                        {
                            count++;
                        }
                        ptr++;
                    }

                    ctx->alpn_count = count + 1;

                    /* mbedtls expects array of strings. Allocate memory for the array. */
                    ctx->alpn_list = (char **)malloc( (ctx->alpn_count + 1) * sizeof(char *));
                    if(NULL == ctx->alpn_list)
                    {
                        free(ctx->alpn);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "malloc failed for alpn_list \r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
                    }

                    /* Convert the input alpn string to array of strings */
                    ptr = ctx->alpn;
                    while( *ptr != '\0' )
                    {
                        ctx->alpn_list[i++] = (char*)ptr;

                        while( *ptr != ',' && *ptr != '\0' )
                        {
                            ptr++;
                            if( *ptr == ',' )
                            {
                                *ptr++ = '\0';
                                break;
                            }
                        }
                    }
                    ctx->alpn_list[i] = NULL;
                    break;
                }
#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
                case CY_SOCKET_SO_ROOTCA_CERTIFICATE_LOCATION:
                {
                    uint8_t load_rootca_location = *((uint8_t *)optval);

                    if(load_rootca_location != CY_SOCKET_ROOTCA_SECURE_STORAGE && load_rootca_location != CY_SOCKET_ROOTCA_RAM)
                    {
                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }

                    ctx->load_rootca_from_ram = load_rootca_location;
                    break;
                }
                case CY_SOCKET_SO_DEVICE_CERT_KEY_LOCATION:
                {
                    uint8_t load_device_cert_key_location = *((uint8_t *)optval);

                    if(load_device_cert_key_location != CY_SOCKET_DEVICE_CERT_KEY_SECURE_STORAGE && load_device_cert_key_location != CY_SOCKET_DEVICE_CERT_KEY_RAM)
                    {
                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }

                    ctx->load_device_cert_key_from_ram = load_device_cert_key_location;
                    break;
                }
#endif
                default:
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid Socket option = [%d]\r\n", optname);

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_OPTION;
                }
            }
            break;

        case CY_SOCKET_SOL_SOCKET:
            switch(optname)
            {
                case CY_SOCKET_SO_RCVTIMEO:
#if LWIP_SO_RCVTIMEO
                {
                    uint32_t recv_timeout = *((uint32_t *)optval);
                    netconn_set_recvtimeout(ctx->conn_handler, recv_timeout);
                    ctx->is_recvtimeout_set = true;
                    break;
                }
#else
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Socket option not supported\r\n");

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return CY_RSLT_MODULE_SECURE_SOCKETS_OPTION_NOT_SUPPORTED;
                }
#endif
                case CY_SOCKET_SO_SNDTIMEO:
#if LWIP_SO_SNDTIMEO
                {
                    uint32_t send_timeout = *((uint32_t *)optval);
                    netconn_set_sendtimeout(ctx->conn_handler, send_timeout);
                    ctx->is_sendtimeout_set = true;
                    break;
                }
#else
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Socket option not supported\r\n");

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return CY_RSLT_MODULE_SECURE_SOCKETS_OPTION_NOT_SUPPORTED;
                }
#endif
                case CY_SOCKET_SO_NONBLOCK:
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Non-block socket option not supported\r\n");

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return CY_RSLT_MODULE_SECURE_SOCKETS_OPTION_NOT_SUPPORTED;
                }

                case CY_SOCKET_SO_TCP_KEEPALIVE_ENABLE:
                {
                    int keep_alive = *((int *)optval);

                    if(keep_alive ==0 || keep_alive ==1)
                    {
                        if(keep_alive)
                        {
                            ip_set_option(ctx->conn_handler->pcb.ip, SOF_KEEPALIVE);
                        }
                        else
                        {
                            ip_reset_option(ctx->conn_handler->pcb.ip, SOF_KEEPALIVE);
                        }
                    }
                    else
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid option value\r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }
                    break;
                }

