StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
                case CY_SOCKET_SO_BROADCAST:
#if IP_SOF_BROADCAST
                {
                    uint8_t broadcast = *((uint8_t *)optval);

                    if(broadcast == 0 || broadcast == 1)
                    {
                        if(broadcast)
                        {
                            ip_set_option(ctx->conn_handler->pcb.ip, SOF_BROADCAST);
                        }
                        else
                        {
                            ip_reset_option(ctx->conn_handler->pcb.ip, SOF_BROADCAST);
                        }
                    }
                    else
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid option value\r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }
                    break;
                }
#else
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Incompatible Socket option\r\n");

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return CY_RSLT_MODULE_SECURE_SOCKETS_OPTION_NOT_SUPPORTED;
                }
#endif
                case CY_SOCKET_SO_RECEIVE_CALLBACK:
                {
                    if(optval != NULL)
                    {
                        cy_socket_recv_event_t *pending_recv_events;
                        cy_rslt_t result = CY_RSLT_SUCCESS;

                        callback_opt = (cy_socket_opt_callback_t *) optval;

                        /*
                         * cy_process_receive_event function accesses ctx->callbacks.receive.callback, so we should protect initialization of
                         * ctx->callbacks.receive.callback pointer with mutex.
                         */
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex locked %s %d\r\n", __FILE__, __LINE__);
                        cy_rtos_get_mutex(&accept_recv_event_mutex, CY_RTOS_NEVER_TIMEOUT);

                        ctx->callbacks.receive.callback = callback_opt->callback;
                        ctx->callbacks.receive.arg = callback_opt->arg;

                        if(ctx->recv_events_cache)
                        {
                            /* Push an event to process the receive events occurred before the callback is registered.*/
                            pending_recv_events = calloc(1, sizeof(cy_socket_recv_event_t));
                            if(pending_recv_events == NULL)
                            {
                                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "memory allocation failed for receive event structure\r\n");

                                cy_rtos_set_mutex(&accept_recv_event_mutex);
                                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex unlocked %s %d\n", __FILE__, __LINE__);

                                cy_rtos_set_mutex(&ctx->socket_mutex);
                                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                                return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
                            }

                            pending_recv_events->recv_count = ctx->recv_events_cache;
                            pending_recv_events->socket = ctx;

                            /* Push event to worker thread to process all the pending receive events. */
                            result = cy_worker_thread_enqueue(&socket_worker, cy_process_pending_receive_events, (void *)pending_recv_events);
                            if(result != CY_RSLT_SUCCESS)
                            {
                                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_defer_work failed at file: %s line: %d with error: 0x%lx\r\n", __FILE__, __LINE__, result);
                                free(pending_recv_events);
                            }

                            ctx->recv_events_cache = 0;
                        }
                        cy_rtos_set_mutex(&accept_recv_event_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex unlocked %s %d\n", __FILE__, __LINE__);
                    }
                    else
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex locked %s %d\r\n", __FILE__, __LINE__);
                        cy_rtos_get_mutex(&accept_recv_event_mutex, CY_RTOS_NEVER_TIMEOUT);

                        ctx->callbacks.receive.callback = NULL;

                        cy_rtos_set_mutex(&accept_recv_event_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex unlocked %s %d\n", __FILE__, __LINE__);
                    }
                    break;
                }
                case CY_SOCKET_SO_DISCONNECT_CALLBACK:
                {
                    if(optval != NULL)
                    {
                        cy_rslt_t result = CY_RSLT_SUCCESS;

                        callback_opt = (cy_socket_opt_callback_t *) optval;
                        ctx->callbacks.disconnect.callback = callback_opt->callback;
                        ctx->callbacks.disconnect.arg = callback_opt->arg;

                        if(ctx->disconnect_event_cache)
                        {
                            result = cy_worker_thread_enqueue(&socket_worker, cy_process_connect_disconnect_notification_event, (void *)ctx->conn_handler);
                            if(result != CY_RSLT_SUCCESS)
                            {
                                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_defer_work failed at file: %s line: %d with error: 0x%lx\r\n", __FILE__, __LINE__, result);
                            }
                        }
                        ctx->disconnect_event_cache = false;
                    }
                    else
                    {
                        ctx->callbacks.disconnect.callback = NULL;
                    }
                    break;
                }
                case CY_SOCKET_SO_CONNECT_REQUEST_CALLBACK:
                {
                    if(optval != NULL)
                    {
                        callback_opt = (cy_socket_opt_callback_t *) optval;
                        ctx->callbacks.connect_request.callback = callback_opt->callback;
                        ctx->callbacks.connect_request.arg = callback_opt->arg;
                    }
                    else
                    {
                        ctx->callbacks.connect_request.callback = NULL;
                    }
                    break;
                }
                default:
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid Socket option = [%d]\r\n", optname);

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

