StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
                    return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_OPTION;
                }

                case CY_SOCKET_SO_BINDTODEVICE:
                {
                    struct netif *netif;
                    cy_socket_interface_t iface_type = ( *(cy_socket_interface_t *)optval);

                    if(iface_type == CY_SOCKET_STA_INTERFACE)
                    {
                        netif = cy_network_get_nw_interface(CY_NETWORK_WIFI_STA_INTERFACE, 0);
                    }
                    else if (iface_type == CY_SOCKET_AP_INTERFACE)
                    {
                        netif = cy_network_get_nw_interface(CY_NETWORK_WIFI_AP_INTERFACE, 0);
                    }
                    else if(iface_type == CY_SOCKET_ETH0_INTERFACE)
                    {
                        netif = cy_network_get_nw_interface(CY_NETWORK_ETH_INTERFACE, 0);
                    }
                    else if(iface_type == CY_SOCKET_ETH1_INTERFACE)
                    {
                        netif = cy_network_get_nw_interface(CY_NETWORK_ETH_INTERFACE, 1);
                    }
                    else
                    {
                        cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid interface type \r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }
                    if(netif == NULL)
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_network_get_nw_interface returned NULL \r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_NETIF_DOES_NOT_EXIST;
                    }

                    if(NETCONNTYPE_GROUP(netconn_type(ctx->conn_handler)) == NETCONN_TCP)
                    {
                        tcp_bind_netif(ctx->conn_handler->pcb.tcp, netif);
                    }
                    else if(NETCONNTYPE_GROUP(netconn_type(ctx->conn_handler)) == NETCONN_UDP)
                    {
                        udp_bind_netif(ctx->conn_handler->pcb.udp, netif);
                    }
                    else
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid socket error \r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
                    }

                    ctx->iface_type = iface_type;
                    ctx->iface_idx = 0;

                    break;
                }
            }
            break;

        case CY_SOCKET_SOL_TCP:
            switch(optname)
            {
                case CY_SOCKET_SO_TCP_KEEPALIVE_INTERVAL:
#if LWIP_TCP_KEEPALIVE
                {
                    ctx->conn_handler->pcb.tcp->keep_intvl = (uint32_t)(*(const int *)optval);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_setsockopt keep-alive interval %ld\r\n", ctx->conn_handler->pcb.tcp->keep_intvl);
                    break;
                }
#else
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Socket option not supported\r\n");

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return CY_RSLT_MODULE_SECURE_SOCKETS_OPTION_NOT_SUPPORTED;
                }
#endif
                case CY_SOCKET_SO_TCP_KEEPALIVE_COUNT:
#if LWIP_TCP_KEEPALIVE
                {
                    ctx->conn_handler->pcb.tcp->keep_cnt = (uint32_t)(*(const int *)optval);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_setsockopt keep-alive count %ld\r\n", ctx->conn_handler->pcb.tcp->keep_cnt);
                    break;
                }
#else
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Socket option not supported\r\n");

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return CY_RSLT_MODULE_SECURE_SOCKETS_OPTION_NOT_SUPPORTED;
                }
#endif
                case CY_SOCKET_SO_TCP_KEEPALIVE_IDLE_TIME:
#if LWIP_TCP_KEEPALIVE
                {
                    ctx->conn_handler->pcb.tcp->keep_idle = (uint32_t)(*(const int *)optval);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_setsockopt keep-alive idle time %ld\r\n", ctx->conn_handler->pcb.tcp->keep_idle);
                    break;
                }
#else
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Socket option not supported\r\n");

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return CY_RSLT_MODULE_SECURE_SOCKETS_OPTION_NOT_SUPPORTED;
                }
#endif
                case CY_SOCKET_SO_TCP_NODELAY:
                {
                    uint8_t tcp_nodelay = *((uint8_t *)optval);

                    if(tcp_nodelay == 0 || tcp_nodelay == 1)
                    {
                        if(tcp_nodelay)
                        {
                            tcp_nagle_disable(ctx->conn_handler->pcb.tcp);
                        }
                        else
                        {
                            tcp_nagle_enable(ctx->conn_handler->pcb.tcp);
                        }
                    }
                    else
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid option value\r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }

                    break;
                }
                default:
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid Socket option = [%d]\r\n", optname);

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

