StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
                    return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_OPTION;
                }
            }
            break;

        case CY_SOCKET_SOL_IP:
            switch(optname)
            {
#if LWIP_IGMP
                case CY_SOCKET_SO_JOIN_MULTICAST_GROUP:
                case CY_SOCKET_SO_LEAVE_MULTICAST_GROUP:
                {
                    ip_addr_t if_addr;
                    ip_addr_t multi_addr;
                    int member_index;
                    err_t err = ERR_OK;
                    cy_rslt_t result = CY_RSLT_SUCCESS;
                    const cy_socket_ip_mreq_t *imr = (const cy_socket_ip_mreq_t *)optval;

                    convert_secure_socket_to_lwip_ip_addr(&if_addr, &imr->if_addr);
                    convert_secure_socket_to_lwip_ip_addr(&multi_addr, &imr->multi_addr);

                    /* Check if the address to join/leave is a valid multiast address. */
                    if(!ip_addr_ismulticast(&multi_addr))
                    {
                        cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid multicast address\r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }

                    do
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "multicast_join_leave_mutex locked %s %d\n", __FILE__, __LINE__);
                        cy_rtos_get_mutex(&multicast_join_leave_mutex, CY_RTOS_NEVER_TIMEOUT);

                        if(imr->if_addr.version != imr->multi_addr.version)
                        {
                            cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "multicast group address type and interface address type are not same\r\n");
                            result = CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                            break;
                        }

                        member_index = find_multicast_member_index(ctx, imr);

                        if(optname == CY_SOCKET_SO_JOIN_MULTICAST_GROUP)
                        {
                            if(member_index != -1)
                            {
                                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "multicast_join_leave_mutex unlocked %s %d\n", __FILE__, __LINE__);
                                result = CY_RSLT_MODULE_SECURE_SOCKETS_ADDRESS_IN_USE;
                                break;
                            }

                            if(multicast_info.multicast_member_count == SECURE_SOCKETS_MAX_MULTICAST_GROUPS)
                            {
                                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Registered multicast member count is already reached maximum allowed count %s %d\n", __FILE__, __LINE__);
                                result = CY_RSLT_MODULE_SECURE_SOCKETS_MAX_MEMBERSHIP_ERROR;
                                break;
                            }

                            member_index = next_free_multicast_slot(0);

                            /* Call wifi-mw-core network activity function to resume the network stack. */
                            cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

#if LWIP_IPV4
                            if(IP_IS_V4(&if_addr))
                            {
                                err = igmp_joingroup(ip_2_ip4(&if_addr), ip_2_ip4(&multi_addr));
                                if(err != ERR_OK)
                                {
                                    cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "igmp_joingroup failed with error %d\r\n", err);
                                    break;
                                }
                            }
#endif
#if LWIP_IPV6
                            if(IP_IS_V6(&if_addr))
                            {
                                err = mld6_joingroup(ip_2_ip6(&if_addr), ip_2_ip6(&multi_addr));
                                if(err != ERR_OK)
                                {
                                    cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "mld6_joingroup failed with error %d\r\n", err);
                                    break;
                                }
                            }
#endif
                            set_multicast_slot_status_bit(member_index);
                            memcpy(&multicast_info.multicast_member_list[member_index].if_addr, &imr->if_addr, sizeof(imr->if_addr));
                            memcpy(&multicast_info.multicast_member_list[member_index].multi_addr, &imr->multi_addr, sizeof(imr->multi_addr));
                            multicast_info.multicast_member_list[member_index].socket = ctx;
                            multicast_info.multicast_member_count++;
                        }
                        else
                        {
                            if(member_index == -1)
                            {
                                result = CY_RSLT_MODULE_SECURE_SOCKETS_MULTICAST_ADDRESS_NOT_REGISTERED;
                                break;
                            }

                            clear_multicast_slot_status_bit(member_index);
                            multicast_info.multicast_member_count--;

                            /* Call wifi-mw-core network activity function to resume the network stack. */
                            cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

#if LWIP_IPV4
                            if (IP_IS_V4(&if_addr))
                            {
                                err = igmp_leavegroup(ip_2_ip4(&if_addr), ip_2_ip4(&multi_addr));
                                if(err != ERR_OK)
                                {
                                    cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "igmp_leavegroup failed with error %d\r\n", err);
                                    break;
                                }
                            }
#endif
#if LWIP_IPV6
                            if (IP_IS_V6(&if_addr))
                            {
                                err = mld6_leavegroup(ip_2_ip6(&if_addr), ip_2_ip6(&multi_addr));
                                if(err != ERR_OK)
                                {
                                    cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "mld6_leavegroup failed with error %d\r\n", err);
                                    break;
                                }
                            }
#endif
                        }
                    } while(0);

                    cy_rtos_set_mutex(&multicast_join_leave_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "multicast_join_leave_mutex unlocked %s %d\n", __FILE__, __LINE__);

