StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
                    if(err != ERR_OK)
                    {
                        result = lwip_to_secure_socket_error(err);
                    }

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return result;
                }
                case CY_SOCKET_SO_IP_MULTICAST_TTL:
                {
                    if(NETCONNTYPE_GROUP(netconn_type(ctx->conn_handler)) != NETCONN_UDP)
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Multicast TTL option is supported only for UDP sockets\r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_OPTION_NOT_SUPPORTED;
                    }
                    udp_set_multicast_ttl(ctx->conn_handler->pcb.udp, *(uint8_t *)optval);
                    break;
                }

#endif
                case CY_SOCKET_SO_IP_TOS:
                {
                    if( (ctx->conn_handler == NULL) || (ctx->conn_handler->pcb.ip == NULL) )
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid connection handle or IP handle \r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }

                    ctx->conn_handler->pcb.ip->tos = (*(uint8_t *)optval);
                    break;
                }

                default:
                {
                    cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid Socket option = [%d]\r\n", optname);

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_OPTION;
                }

            }
    }

    cy_rtos_set_mutex(&ctx->socket_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_setsockopt End\r\n");
    return CY_RSLT_SUCCESS;
}
/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_getsockopt(cy_socket_t handle,  int level, int optname, void *optval, uint32_t *optlen)
{
    cy_socket_ctx_t *ctx = NULL;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_getsockopt Start\r\n");
    if(CY_SOCKET_INVALID_HANDLE == handle)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    if(optval == NULL || optlen == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_socket_getsockopt bad arg\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }
    ctx = (cy_socket_ctx_t *) handle;

    if(!is_socket_valid(ctx))
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    /* While this function is running, application may delete the socket. Protect entire function with a mutex. */
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex locked %s %d\r\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&ctx->socket_mutex, CY_RTOS_NEVER_TIMEOUT);

    switch(level)
    {
        case CY_SOCKET_SOL_TLS:
        {
            switch(optname)
            {
                case CY_SOCKET_SO_TLS_AUTH_MODE:
                {
                    if(*optlen < sizeof(cy_socket_tls_auth_mode_t))
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "insufficient option value buffer\r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }

                    *((cy_socket_tls_auth_mode_t *)optval) = (cy_socket_tls_auth_mode_t)ctx->auth_mode;
                    *optlen = sizeof(cy_socket_tls_auth_mode_t);
                    break;
                }
                case CY_SOCKET_SO_SERVER_NAME_INDICATION:
                {
                    if(ctx->hostname)
                    {
                        if(*optlen < strlen(ctx->hostname))
                        {
                            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "insufficient option value buffer\r\n");

                            cy_rtos_set_mutex(&ctx->socket_mutex);
                            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                            return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                        }

                        *optlen = strlen(ctx->hostname);
                        memcpy(optval, ctx->hostname, *optlen);
                    }
                    else
                    {
                        *optlen = 0;
                    }
                    break;
                }

                case CY_SOCKET_SO_TLS_MFL:
                {
                    uint32_t mfl;

                    if(*optlen < sizeof(mfl))
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "insufficient option value buffer\r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }

                    mfl = mfl_code_to_max_fragment_length(ctx->mfl_code);
                    *((uint32_t *)optval) = mfl;
                    *optlen = sizeof(mfl);
                    break;
                }
                default:
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid Socket option\r\n");

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

