StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
                    return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_OPTION;
                }
            }
        }
        break;

        case CY_SOCKET_SOL_TCP:
        {
            switch(optname)
            {
                case CY_SOCKET_SO_TCP_KEEPALIVE_INTERVAL:
#if LWIP_TCP_KEEPALIVE
                {
                    if(*optlen < sizeof(uint32_t))
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "insufficient option value buffer\r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }

                    *(uint32_t *)optval = (uint32_t)(ctx->conn_handler->pcb.tcp->keep_intvl);
                    *optlen = sizeof(uint32_t);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_getsockopt keep-alive interval %ld\r\n", *(uint32_t *)optval);
                    break;
                }
#else
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Socket option not supported\r\n");

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return CY_RSLT_MODULE_SECURE_SOCKETS_OPTION_NOT_SUPPORTED;
                }
#endif
                case CY_SOCKET_SO_TCP_KEEPALIVE_COUNT:
#if LWIP_TCP_KEEPALIVE
                {
                    if(*optlen < sizeof(uint32_t))
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "insufficient option value buffer\r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }

                    *(uint32_t *)optval = (uint32_t)(ctx->conn_handler->pcb.tcp->keep_cnt);
                    *optlen = sizeof(uint32_t);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_getsockopt keep-alive count %ld\r\n", *(uint32_t *)optval);
                    break;
                }
#else
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Socket option not supported\r\n");

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return CY_RSLT_MODULE_SECURE_SOCKETS_OPTION_NOT_SUPPORTED;
                }
#endif
                case CY_SOCKET_SO_TCP_KEEPALIVE_IDLE_TIME:
#if LWIP_TCP_KEEPALIVE
                {
                    if(*optlen < sizeof(uint32_t))
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "insufficient option value buffer\r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }

                    *(uint32_t *)optval = (uint32_t)(ctx->conn_handler->pcb.tcp->keep_idle);
                    *optlen = sizeof(uint32_t);

                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_getsockopt keep-alive idle time %ld\r\n", *(uint32_t *)optval);
                    break;
                }
#else
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Socket option not supported\r\n");

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return CY_RSLT_MODULE_SECURE_SOCKETS_OPTION_NOT_SUPPORTED;
                }
#endif
                case CY_SOCKET_SO_TCP_NODELAY:
                {
                    if(*optlen < sizeof(uint8_t))
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "insufficient option value buffer\r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }

                    *(uint8_t *)optval = (uint8_t)tcp_nagle_disabled(ctx->conn_handler->pcb.tcp);
                    *optlen = sizeof(uint8_t);

                    break;
                }
                default:
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid Socket option\r\n");

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_OPTION;
                }
            }
        }
        break;

        case CY_SOCKET_SOL_IP:
        {
            switch(optname)
            {
#if LWIP_IGMP
                case CY_SOCKET_SO_IP_MULTICAST_TTL:
                {
                    if(*optlen < sizeof(uint8_t))
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "insufficient option value buffer\r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }

                    if(NETCONNTYPE_GROUP(netconn_type(ctx->conn_handler)) != NETCONN_UDP)
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Multicast TTL option is supported only for UDP sockets\r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_OPTION_NOT_SUPPORTED;
                    }
                    *(uint8_t *)optval = udp_get_multicast_ttl(ctx->conn_handler->pcb.udp);
                    *optlen = sizeof(uint8_t);

                    break;
                }
#endif
                case CY_SOCKET_SO_IP_TOS:
                {
                    if(*optlen < sizeof(uint8_t))
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "insufficient option value buffer\r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }

                    if( (ctx->conn_handler == NULL) || (ctx->conn_handler->pcb.ip == NULL) )
                    {
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid connection handle or IP handle \r\n");

                        cy_rtos_set_mutex(&ctx->socket_mutex);
                        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
                    }

