StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
                    *(uint8_t *)optval = ctx->conn_handler->pcb.ip->tos;
                    *optlen = sizeof(uint8_t);

                    break;
                }
                default:
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid Socket option\r\n");

                    cy_rtos_set_mutex(&ctx->socket_mutex);
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

                    return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_OPTION;
                }
            }
        }
        break;
        default:
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid level\r\n");

            cy_rtos_set_mutex(&ctx->socket_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

            return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_OPTION;
        }
    }

    cy_rtos_set_mutex(&ctx->socket_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_getsockopt End\r\n");
    return CY_RSLT_SUCCESS;
}

/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_connect(cy_socket_t handle, cy_socket_sockaddr_t * address, uint32_t address_length)
{
    cy_socket_ctx_t * ctx;
    ip_addr_t remote;
    cy_tls_params_t tls_params = { 0 };
    err_t ret;
    cy_rslt_t result = CY_RSLT_SUCCESS;

    UNUSED_ARG(address_length);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_connect Start\r\n");
    if(CY_SOCKET_INVALID_HANDLE == handle)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    if(address == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Address passed is NULL\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    ctx = (cy_socket_ctx_t *) handle;

    if(!is_socket_valid(ctx))
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }


    /* While this function is running, application may delete the socket. Protect entire function with a mutex. */
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex locked %s %d\r\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&ctx->socket_mutex, CY_RTOS_NEVER_TIMEOUT);

    if(ctx->transport_protocol == CY_SOCKET_IPPROTO_UDP)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_socket_connect API is not support for UDP sockets\r\n");

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return CY_RSLT_MODULE_SECURE_SOCKETS_NOT_SUPPORTED;
    }

    memset(&remote, 0, sizeof(ip_addr_t));

    /* convert IP format from secure socket to LWIP */
    result = convert_secure_socket_to_lwip_ip_addr(&remote, &address->ip_address);
    if(result != CY_RSLT_SUCCESS)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed conversion from secure socket to LWIP \r\n");

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return result;
    }

    /* Acquire mutex, so that socket disconnect and connect are in sync. While connect operation is in progress
     * this mutex lock will prevent disconnection. */
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "netconn_mutex locked %s %d\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&ctx->netconn_mutex, CY_RTOS_NEVER_TIMEOUT);

    /* Call wifi-mw-core network activity function to resume the network stack. */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    ret = netconn_connect(ctx->conn_handler, &remote, address->port) ;
    if(ret != ERR_OK)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "netconn_connect failed with error = %d \r\n", ret);
        result = LWIP_TO_CY_SECURE_SOCKETS_ERR(ret);
        goto exit;
    }
    ctx->status |=  SOCKET_STATUS_FLAG_CONNECTED;

    if(ctx->enforce_tls)
    {
        tls_params.context = ctx;
        tls_params.network_send = tls_network_send_callback;
        tls_params.network_recv = tls_network_receive_callback;
        tls_params.tls_identity = ctx->tls_identity;
        tls_params.rootca_certificate = ctx->rootca_certificate;
        tls_params.rootca_certificate_length = ctx->rootca_certificate_len;
        tls_params.auth_mode = ctx->auth_mode;
        tls_params.mfl_code = ctx->mfl_code;
        tls_params.hostname = ctx->hostname;
        tls_params.alpn_list = (const char**)ctx->alpn_list;
#ifdef CY_SECURE_SOCKETS_PKCS_SUPPORT
        tls_params.load_rootca_from_ram = ctx->load_rootca_from_ram;
        tls_params.load_device_cert_key_from_ram = ctx->load_device_cert_key_from_ram;
#endif
        result = cy_tls_create_context(&ctx->tls_ctx, &tls_params);
        if(result != CY_RSLT_SUCCESS)
        {
            netconn_close(ctx->conn_handler);
            ctx->status &= ~(SOCKET_STATUS_FLAG_CONNECTED);

            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_tls_create_context failed with error %lu\n", result);
            result = TLS_TO_CY_SECURE_SOCKETS_ERR(result);
            goto exit;
        }
        result = cy_tls_connect(ctx->tls_ctx, CY_TLS_ENDPOINT_CLIENT, 0);
        if(result != CY_RSLT_SUCCESS)
        {
            netconn_close(ctx->conn_handler);
            ctx->status &= ~(SOCKET_STATUS_FLAG_CONNECTED);

            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_tls_connect failed with error %lu\n", result);
            result = TLS_TO_CY_SECURE_SOCKETS_ERR(result);
            goto exit;
        }
        ctx->status |=  SOCKET_STATUS_FLAG_SECURED;
        ctx->data_received = 0;
    }

exit:
    cy_rtos_set_mutex(&ctx->netconn_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "netconn_mutex unlocked %s %d\n", __FILE__, __LINE__);

    cy_rtos_set_mutex(&ctx->socket_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

