StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_connect End\r\n");

    return result;
}
/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_disconnect(cy_socket_t handle, uint32_t timeout)
{
    cy_socket_ctx_t *ctx;
    err_t error;
    UNUSED_ARG(timeout);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_disconnect Start\r\n");
    if(CY_SOCKET_INVALID_HANDLE == handle)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }
    ctx = (cy_socket_ctx_t *) handle;

    if(!is_socket_valid(ctx))
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    /* While this function is running, application may delete the socket. Protect entire function with a mutex. */
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex locked %s %d\r\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&ctx->socket_mutex, CY_RTOS_NEVER_TIMEOUT);

    if(ctx->transport_protocol == CY_SOCKET_IPPROTO_UDP)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_socket_disconnect API is not support for UDP sockets\r\n");

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return CY_RSLT_MODULE_SECURE_SOCKETS_NOT_SUPPORTED;
    }

    /* Call wifi-mw-core network activity function to resume the network stack. */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "netconn_mutex locked %s %d\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&ctx->netconn_mutex, CY_RTOS_NEVER_TIMEOUT);
    if(ctx->role == CY_TLS_ENDPOINT_CLIENT)
    {
        if((ctx->status & SOCKET_STATUS_FLAG_CONNECTED) !=  SOCKET_STATUS_FLAG_CONNECTED)
        {
            /* Connection is not established. But check, netconn handler is created, if yes, delete it */
            if(ctx->conn_handler)
            {
                error = netconn_delete(ctx->conn_handler);
                if(error != ERR_OK)
                {
                    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "netconn_delete failed with error %d\n",  error);
                }
                else
                {
                    ctx->conn_handler = NULL;
                }
            }

            cy_rtos_set_mutex(&ctx->netconn_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "netconn_mutex unlocked %s %d\n", __FILE__, __LINE__);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Socket not connected\r\n");

            cy_rtos_set_mutex(&ctx->socket_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

            return CY_RSLT_MODULE_SECURE_SOCKETS_NOT_CONNECTED;
        }

        if(true == ctx->enforce_tls && (ctx->status & SOCKET_STATUS_FLAG_SECURED) ==  SOCKET_STATUS_FLAG_SECURED)
        {
            cy_tls_delete_context(ctx->tls_ctx);

            /* Free the memory allocated for RootCA certificate for the socket.*/
            if(ctx->rootca_certificate)
            {
                free(ctx->rootca_certificate);
                ctx->rootca_certificate = NULL;
            }
            ctx->status &= ~(SOCKET_STATUS_FLAG_SECURED);
        }
        ctx->status &= ~(SOCKET_STATUS_FLAG_CONNECTED);
    }
    else
    {
        if((ctx->status & SOCKET_STATUS_FLAG_LISTENING) != SOCKET_STATUS_FLAG_LISTENING)
        {
            cy_rtos_set_mutex(&ctx->netconn_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "netconn_mutex unlocked %s %d\n", __FILE__, __LINE__);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Socket not listening\r\n");

            cy_rtos_set_mutex(&ctx->socket_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

            return CY_RSLT_MODULE_SECURE_SOCKETS_NOT_LISTENING;
        }
        ctx->status &= ~(SOCKET_STATUS_FLAG_LISTENING);
    }

    /* Free the pbuf that is stored when partial data is copied from it */
    if(ctx->buf)
    {
        pbuf_free(ctx->buf);
        ctx->buf = NULL;
    }

    /* Close the netconn */
    error = netconn_close(ctx->conn_handler);
    if(error != ERR_OK)
    {
        if(error == ERR_CONN || error == ERR_CLSD)
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "netconn_close failed with error %d\n",  error);
        }
        else
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "netconn_close failed with error %d\n",  error);
        }
    }

    /* LwIP doesn't allow reusing netconn object once it's closed. Also for server mode sockets, the client sockets
     * needs to be managed internally without expecting the caller to invoke cy_socket_delete() for the accepted client sockets.
     * Hence deleting the netconn object in this function (i.e., cy_socket_disconnect) instead of cy_socket_delete.
     */
    if(ctx->conn_handler)
    {
        error = netconn_delete(ctx->conn_handler);
        if(error != ERR_OK)
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "netconn_delete failed with error %d\n",  error);
        }
        else
        {
            ctx->conn_handler = NULL;
        }
    }
    
    /* Reset the data_received element of the socket */
    ctx->data_received = 0;

    /* Release the mutex as connection status is already updated and done with LwIP netconn close/delete */
    cy_rtos_set_mutex(&ctx->netconn_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "netconn_mutex unlocked %s %d\n", __FILE__, __LINE__);

    cy_rtos_set_mutex(&ctx->socket_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_disconnect End\r\n");
    return CY_RSLT_SUCCESS;
}
/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_send(cy_socket_t handle, const void *data, uint32_t size, int flags, uint32_t *bytes_sent)
{
    cy_socket_ctx_t *ctx;
    cy_rslt_t ret;

    UNUSED_ARG(flags);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_send Start\r\n");
    if(CY_SOCKET_INVALID_HANDLE == handle)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    if(bytes_sent == NULL || data == NULL || size == 0)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "bytes_sent or data pointer is NULL or size is zero \r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    ctx = (cy_socket_ctx_t *) handle;

    if(!is_socket_valid(ctx))
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

