StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
    if(bytes_received == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "bytes_received passed as NULL \r\n");

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    *bytes_received = 0;

    /* src_addr cannot be null when flag passed as CY_SOCKET_FLAGS_RECVFROM_SRC_FILTER */
    if((flags & CY_SOCKET_FLAGS_RECVFROM_SRC_FILTER) == CY_SOCKET_FLAGS_RECVFROM_SRC_FILTER)
    {
        if(src_addr == NULL)
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Flag CY_SOCKET_FLAGS_RECVFROM_SRC_FILTER is set. Hence src_addr can not be null \r\n");

            cy_rtos_set_mutex(&ctx->socket_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

            return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
        }
        else
        {
            src_filter_set = true;
        }
    }

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "netconn_recvfrom_mutex locked %s %d\n", __FILE__, __LINE__);
    result = cy_rtos_get_mutex(&netconn_recvfrom_mutex, CY_RTOS_NEVER_TIMEOUT);
    if(result != CY_RSLT_SUCCESS)
    {
        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return result;
    }

    /* Call wifi-mw-core network activity function to resume the network stack. */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    if(src_filter_set == true)
    {
        memset(&remote, 0, sizeof(ip_addr_t));

        /* convert IP format from secure socket to LWIP */
        result = convert_secure_socket_to_lwip_ip_addr(&remote, &src_addr->ip_address);
        if( result != CY_RSLT_SUCCESS )
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed conversion from secure socket to LWIP \r\n");
            cy_rtos_set_mutex(&netconn_recvfrom_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "netconn_recvfrom_mutex unlocked %s %d\n", __FILE__, __LINE__);

            cy_rtos_set_mutex(&ctx->socket_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

            return result;
        }

        err = netconn_connect(ctx->conn_handler, &remote, src_addr->port) ;
        if(err != ERR_OK)
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "netconn_connect failed with error = %d \r\n", err);
            cy_rtos_set_mutex(&netconn_recvfrom_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "netconn_recvfrom_mutex unlocked %s %d\n", __FILE__, __LINE__);

            cy_rtos_set_mutex(&ctx->socket_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

            return LWIP_TO_CY_SECURE_SOCKETS_ERR(err);
        }
    }

    err = netconn_recv(ctx->conn_handler, &net_buf);
    if(err != ERR_OK)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "netconn_recv failed with error %d\n", err);
        result = LWIP_TO_CY_SECURE_SOCKETS_ERR(err);
        goto exit;
    }

    addr = netbuf_fromaddr(net_buf);
    peer_addr.port = netbuf_fromport(net_buf);

    /* convert IP format from LWIP to secure socket */
    result = convert_lwip_to_secure_socket_ip_addr(&peer_addr.ip_address, addr);
    if(result != CY_RSLT_SUCCESS)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed conversion from LWIP to secure socket \r\n");
        goto exit;
    }

    *bytes_received = netbuf_copy(net_buf, buffer, (u16_t)length);

    /* Copy source address */
    if(src_addr != NULL)
    {
        memcpy(src_addr, &peer_addr, sizeof(cy_socket_sockaddr_t));
    }

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_recvfrom End\r\n");

exit:
    if(src_filter_set == true)
    {
        netconn_disconnect(ctx->conn_handler);
    }

    /* TODO : Currently remaining data in netbuf is silently discarded if application doesnt pass enough buffer
     *        to copy data. Need to implement logic to buffer the data if application doesnt pass enough buffer.
     */
    if(net_buf != NULL)
    {
        netbuf_delete(net_buf);
    }

    cy_rtos_set_mutex(&netconn_recvfrom_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "netconn_recvfrom_mutex unlocked %s %d\n", __FILE__, __LINE__);

    cy_rtos_set_mutex(&ctx->socket_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

    return result;
}
/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_gethostbyname(const char *hostname, cy_socket_ip_version_t ip_ver, cy_socket_ip_address_t *addr)
{
    err_t          result;
    ip_addr_t      ip_address ;
    uint8_t        dns_type = NETCONN_DNS_IPV4;

    /* dns_type is only used when both LWIP_IPV4 and LWIP_IPV6 is enabled in LWIP configuration file.
     * otherwise dns_type is unused and gives warning during compilation. To fix the warning, made variable
     * UNUSED but still can be used for case when both LWIP_IPV4 and LWIP_IPV6 enabled.
     */
    UNUSED_VARIABLE(dns_type);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_gethostbyname Start\r\n");
    if( (NULL == hostname) || (NULL == addr))
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "netconn_gethostbyname failed invalid arg \n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    if(ip_ver == CY_SOCKET_IP_VER_V6)
    {
#if LWIP_IPV6
        dns_type = NETCONN_DNS_IPV6;
#else
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "netconn_gethostbyname failed LWIP_IPV6 not enabled \n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
#endif
    }
    else if(ip_ver == CY_SOCKET_IP_VER_V4)
    {
#if LWIP_IPV4
        dns_type = NETCONN_DNS_IPV4;
#else
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "netconn_gethostbyname failed LWIP_IPV4 not enabled \n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
#endif
    }
    else
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid IP version type \n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    /* Call wifi-mw-core network activity function to resume the network stack. */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    result = netconn_gethostbyname_addrtype(hostname, &ip_address, dns_type);
    if(result != ERR_OK)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "netconn_gethostbyname failed with error code %d\n", result);
        if( (result == ERR_ARG) || (result == ERR_VAL))
        {
            return CY_RSLT_MODULE_SECURE_SOCKETS_HOST_NOT_FOUND;
        }
        else
        {
            return LWIP_TO_CY_SECURE_SOCKETS_ERR(result);
        }
    }

    /* convert IP format from LWIP to secure socket */
    result = convert_lwip_to_secure_socket_ip_addr(addr, &ip_address);
    if(result != CY_RSLT_SUCCESS)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed conversion from LWIP to secure socket \r\n");
        return result;
    }

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_gethostbyname End\r\n");
    return CY_RSLT_SUCCESS;
}
/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_poll(cy_socket_t handle, uint32_t *rwflags, uint32_t timeout)
{
    cy_socket_ctx_t * ctx;
    uint32_t flags;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    int recv_avail = 0;

