StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_poll Start\r\n");
    if(CY_SOCKET_INVALID_HANDLE == handle)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    if(rwflags == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "rwflags pointer passed is NULL\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    ctx = (cy_socket_ctx_t *) handle;

    if(!is_socket_valid(ctx))
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    /* While this function is running, application may delete the socket. Protect entire function with a mutex. */
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex locked %s %d\r\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&ctx->socket_mutex, CY_RTOS_NEVER_TIMEOUT);

    flags = *rwflags;
    *rwflags = 0;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "netconn_mutex locked %s %d\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&ctx->netconn_mutex, CY_RTOS_NEVER_TIMEOUT);

    if( ( ctx->transport_protocol != CY_SOCKET_IPPROTO_UDP ) &&
        !( ( !ctx->enforce_tls && ( ctx->status & SOCKET_STATUS_FLAG_CONNECTED) ==  SOCKET_STATUS_FLAG_CONNECTED ) ||
        ( ( ctx->status & SOCKET_STATUS_FLAG_SECURED) ==  SOCKET_STATUS_FLAG_SECURED) ) )
    {
        cy_rtos_set_mutex(&ctx->netconn_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "netconn_mutex unlocked %s %d\n", __FILE__, __LINE__);

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return CY_RSLT_MODULE_SECURE_SOCKETS_NOT_CONNECTED;
    }

    if(flags & CY_SOCKET_POLL_READ )
    {
        SYS_ARCH_GET(ctx->conn_handler->recv_avail, recv_avail);
        if(recv_avail > 0 || ctx->buf)
        {
            *rwflags |= CY_SOCKET_POLL_READ;
        }
        else
        {
            while(timeout > 0)
            {
                SYS_ARCH_GET(ctx->conn_handler->recv_avail, recv_avail);
                if(recv_avail > 0 || ctx->buf)
                {
                    *rwflags |= CY_SOCKET_POLL_READ;
                    break ;
                }

                cy_rtos_delay_milliseconds(1);
                if(timeout != 0xffffffff)
                {
                    timeout--;
                }
            }
        }
    }
    if(flags & CY_SOCKET_POLL_WRITE)
    {
        while(timeout > 0)
        {
            if(ctx->send_events)
            {
                *rwflags |= CY_SOCKET_POLL_WRITE;
                break;
            }

            cy_rtos_delay_milliseconds(1);
            if(timeout != 0xffffffff)
            {
                timeout--;
            }
        }
    }

    cy_rtos_set_mutex(&ctx->netconn_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "netconn_mutex unlocked %s %d\n", __FILE__, __LINE__);

    cy_rtos_set_mutex(&ctx->socket_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_poll End\r\n");
    return result;
}
/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_delete(cy_socket_t handle)
{
    cy_socket_ctx_t *ctx;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_delete Start\r\n");
    if(CY_SOCKET_INVALID_HANDLE == handle)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }
    ctx = (cy_socket_ctx_t *) handle;

    if(!is_socket_valid(ctx))
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    if(ctx->transport_protocol != CY_SOCKET_IPPROTO_UDP)
    {
        /* disconnect the socket */
        cy_socket_disconnect(ctx, 0);

        /*
         *  FALSE-POSITIVE: CID 241171: Read from pointer after free (USE_AFTER_FREE)
         *  Reason:
         *     'ctx' passed as argument to this function can't be accepted client context, hence ctx->server_socket will be always NULL.
         *     Hence this API `cy_socket_disconnect(ctx, 0);` which is invoked above in this function will never invoke `free_socket(ctx);`
         *     Therefore when the code execution reaches this point, 'ctx' will not be NULL.
         */
        if(ctx->hostname)
        {
            free(ctx->hostname);
            ctx->hostname = NULL;
        }

        /* free alpn string */
        if(ctx->alpn)
        {
            free(ctx->alpn);
            ctx->alpn = NULL;
        }

        /* free alpn array of strings */
        if(ctx->alpn_list)
        {
            free(ctx->alpn_list);
            ctx->alpn_list = NULL;
        }
    }
    else
    {
        int member_index = 0;
        int count = 0;
        int num_multicast_groups = 0;
        ip_addr_t if_addr;
        ip_addr_t multi_addr;
        err_t err = ERR_OK;

        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "multicast_join_leave_mutex locked %s %d\n", __FILE__, __LINE__);
        cy_rtos_get_mutex(&multicast_join_leave_mutex, CY_RTOS_NEVER_TIMEOUT);

        /* Call wifi-mw-core network activity function to resume the network stack. */
        cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);
#if LWIP_IGMP
        num_multicast_groups = multicast_info.multicast_member_count;
        while(count < num_multicast_groups)
        {
            member_index = next_registered_multicast_slot(member_index);

            if(multicast_info.multicast_member_list[member_index].socket == ctx)
            {
                convert_secure_socket_to_lwip_ip_addr(&if_addr, &multicast_info.multicast_member_list[member_index].if_addr);
                convert_secure_socket_to_lwip_ip_addr(&multi_addr, &multicast_info.multicast_member_list[member_index].multi_addr);
#if LWIP_IPV4
                if(IP_IS_V4(&if_addr))
                {
                    err = igmp_leavegroup(ip_2_ip4(&if_addr), ip_2_ip4(&multi_addr));
                    if(err != ERR_OK)
                    {
                        cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "igmp_leavegroup failed with error %d\r\n", err);
                    }
                }
#endif
#if LWIP_IPV6
                if(IP_IS_V6(&if_addr))
                {
                    err = mld6_leavegroup(ip_2_ip6(&if_addr), ip_2_ip6(&multi_addr));
                    if(err != ERR_OK)
                    {
                        cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "mld6_leavegroup failed with error %d\r\n", err);
                    }
                }
#endif
                clear_multicast_slot_status_bit(member_index);
                multicast_info.multicast_member_count--;
            }
            member_index++;
            count++;
        }
#endif
        cy_rtos_set_mutex(&multicast_join_leave_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "multicast_join_leave_mutex unlocked %s %d\n", __FILE__, __LINE__);

        netconn_delete(ctx->conn_handler);
        ctx->conn_handler = NULL;
    }
    /* free the socket context */
    free_socket(ctx);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_delete End\r\n");

    return CY_RSLT_SUCCESS;
}
/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_deinit(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_deinit Start\r\n");
    if(!init_ref_count)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "library not initialized\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_NOT_INITIALIZED;
    }

