StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
    ctx->role = CY_TLS_ENDPOINT_SERVER;
    ctx->status |=  SOCKET_STATUS_FLAG_LISTENING;

    /* If user has not set the authentication mode, set the default authentication mode to NONE. */
    if(!ctx->is_authmode_set)
    {
        ctx->auth_mode = CY_SOCKET_TLS_VERIFY_NONE;
    }

    cy_rtos_set_mutex(&ctx->socket_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_listen End\r\n");
    return CY_RSLT_SUCCESS;
}
/*-----------------------------------------------------------*/
cy_rslt_t cy_socket_accept(cy_socket_t handle, cy_socket_sockaddr_t *address, uint32_t *address_length, cy_socket_t *socket)
{
    cy_socket_ctx_t *ctx;
    cy_socket_ctx_t *accept_ctx;
    struct netconn *conn;
    cy_tls_params_t tls_params = { 0 };
    err_t result;
    cy_rslt_t ret;
    int recvevent = 0;
    int disconnectevent = 0;
    ip_addr_t peer_addr;
    u16_t port;
    cy_socket_recv_event_t *pending_recv_events;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_accept Start\r\n");
    if(socket == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Accepted client socket pointer is NULL\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    *socket = CY_SOCKET_INVALID_HANDLE;

    if(CY_SOCKET_INVALID_HANDLE == handle)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid server handle\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }
    ctx = (cy_socket_ctx_t *) handle;

    if(!is_socket_valid(ctx))
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid server handle\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    /* While this function is running, application may delete the socket. Protect entire function with a mutex. */
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex locked %s %d\r\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&ctx->socket_mutex, CY_RTOS_NEVER_TIMEOUT);

    if(ctx->conn_handler == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid server handle\r\n");

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    if(address == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Address passed as NULL\r\n");

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    /* Check if this socket is in listening state or not */
    if(!(ctx->status &=  SOCKET_STATUS_FLAG_LISTENING))
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Server socket is not in listening state\r\n");

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return CY_RSLT_MODULE_SECURE_SOCKETS_NOT_LISTENING;
    }

    accept_ctx = alloc_socket();
    if(accept_ctx == NULL)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to allocate socket context for accepted client socket\r\n");

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
    }

    /* Call wifi-mw-core network activity function to resume the network stack. */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    result = netconn_accept(ctx->conn_handler, &conn);
    if(result != ERR_OK)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "netconn_accept failed with error = %d \r\n", result);
        free_socket(accept_ctx);

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return LWIP_TO_CY_SECURE_SOCKETS_ERR(result);
    }
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "new connection accepted.\n\n");

    accept_ctx->conn_handler = conn;
    accept_ctx->status |=  SOCKET_STATUS_FLAG_CONNECTED;
    accept_ctx->callbacks.disconnect = ctx->callbacks.disconnect;
    accept_ctx->callbacks.receive = ctx->callbacks.receive;

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex locked %s %d\r\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&accept_recv_event_mutex, CY_RTOS_NEVER_TIMEOUT);

    /*
     * Find if disconnect and receive events occurred prior to socket context is created for accepted client socket.
     * conn->socket is -1 if no disconnect or receive events are occurred before socket context is created for accepted client socket.
     */
    if(conn->socket != -1)
    {
        /*
         * Check the disconnect event bit.
         */
        disconnectevent = (conn->socket) & SECURE_SOCKETS_DISCONNET_EVENT_BIT_MASK;

        /*
         * Clear disconnect event bit in conn->socket
         */
        conn->socket = (conn->socket) & ~SECURE_SOCKETS_DISCONNET_EVENT_BIT_MASK;

        /*
         * Get the receive event count occurred before socket context is created.
         */
        recvevent = (conn->socket) & ~SECURE_SOCKETS_RECEIVE_EVENT_BIT_MASK;

        /*
         * Clear receive event bit in conn->socket. Clearing this bit helps in cy_process_receive_event function to identify that socket context is created.
         */
        conn->socket = (conn->socket) & ~SECURE_SOCKETS_RECEIVE_EVENT_BIT_MASK;
    }

    conn->socket = accept_ctx->id;
    cy_rtos_set_mutex(&accept_recv_event_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex unlocked %s %d\n", __FILE__, __LINE__);

    *socket = accept_ctx;

    /*
     * If the receive callback is already registered on server socket, queue an event to process the pending receive events.
     * If the receive callback is not registered yet, all the pending receive events are processed in socket option CY_SOCKET_SO_RECEIVE_CALLBACK.
     */
    if(accept_ctx->callbacks.receive.callback)
    {

        /* Allocate memory for event to be pushed to the worker thread for processing the receive events occurred prior to socket context creation for accepted client socket.*/
        pending_recv_events = calloc(1, sizeof(cy_socket_recv_event_t));
        if(pending_recv_events == NULL)
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "memory allocation failed for receive evetnt structure\r\n");
            netconn_close(accept_ctx->conn_handler);
            netconn_delete(accept_ctx->conn_handler);
            free_socket(accept_ctx);
            *socket = CY_SOCKET_INVALID_HANDLE;

            cy_rtos_set_mutex(&ctx->socket_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

            return CY_RSLT_MODULE_SECURE_SOCKETS_NOMEM;
        }

