StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
        pending_recv_events->recv_count = recvevent;
        pending_recv_events->socket = accept_ctx;

         /* Push event to worker thread to process all the pending receive events.*/
        result = cy_worker_thread_enqueue(&socket_worker, cy_process_pending_receive_events, (void *)pending_recv_events);
        if(result != CY_RSLT_SUCCESS)
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_defer_work failed at file: %s line: %d with error: 0x%lx\r\n", __FILE__, __LINE__, result);
            netconn_close(accept_ctx->conn_handler);
            netconn_delete(accept_ctx->conn_handler);
            free_socket(accept_ctx);
            *socket = CY_SOCKET_INVALID_HANDLE;
            free(pending_recv_events);

            cy_rtos_set_mutex(&ctx->socket_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

            return result;
        }
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex locked %s %d\r\n", __FILE__, __LINE__);
        cy_rtos_get_mutex(&accept_recv_event_mutex, CY_RTOS_NEVER_TIMEOUT);

        accept_ctx->recv_events_cache -= recvevent;

        cy_rtos_set_mutex(&accept_recv_event_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex unlocked %s %d\n", __FILE__, __LINE__);
    }
    else
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex locked %s %d\r\n", __FILE__, __LINE__);
        cy_rtos_get_mutex(&accept_recv_event_mutex, CY_RTOS_NEVER_TIMEOUT);

        accept_ctx->recv_events_cache += recvevent;

        cy_rtos_set_mutex(&accept_recv_event_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "accept_recv_event_mutex unlocked %s %d\n", __FILE__, __LINE__);

    }

#if LWIP_SO_RCVTIMEO

    /**
     * Set the receive timeout to the value set by the application. If not already set, use the default value.
     */

    if(ctx->is_recvtimeout_set)
    {
        netconn_set_recvtimeout(accept_ctx->conn_handler, netconn_get_recvtimeout(ctx->conn_handler));
    }
    else
    {
        netconn_set_recvtimeout(accept_ctx->conn_handler, DEFAULT_RECV_TIMEOUT_IN_MSEC);
    }

#endif

#if LWIP_SO_SNDTIMEO

    /**
     * Set the send timeout to the value set by the application. If not already set, use the default value.
     */
    if(ctx->is_sendtimeout_set)
    {
        netconn_set_sendtimeout(accept_ctx->conn_handler, netconn_get_sendtimeout(ctx->conn_handler));
    }
    else
    {
        netconn_set_sendtimeout(accept_ctx->conn_handler, DEFAULT_SEND_TIMEOUT_IN_MSEC);
    }
#endif

    result = netconn_peer(accept_ctx->conn_handler, &peer_addr, &port);

    /* Convert IP format from LWIP to secure socket */
    result = convert_lwip_to_secure_socket_ip_addr(&address->ip_address, &peer_addr);
    if(result != CY_RSLT_SUCCESS)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed conversion from LWIP to secure socket \r\n");
        netconn_close(accept_ctx->conn_handler);
        netconn_delete(accept_ctx->conn_handler);
        free_socket(accept_ctx);
        *socket = CY_SOCKET_INVALID_HANDLE;

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return result;
    }

    address->port = port;
    *address_length = sizeof(*address);

    if(ctx->enforce_tls)
    {
        tls_params.context = accept_ctx;
        tls_params.network_send = tls_network_send_callback;
        tls_params.network_recv = tls_network_receive_callback;
        tls_params.tls_identity = ctx->tls_identity;
        tls_params.auth_mode = ctx->auth_mode;

        accept_ctx->enforce_tls = 1;

        ret = cy_tls_create_context(&accept_ctx->tls_ctx, &tls_params);
        if(ret != CY_RSLT_SUCCESS)
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_tls_create_context failed with error %ld\n", ret);
            netconn_close(accept_ctx->conn_handler);
            netconn_delete(accept_ctx->conn_handler);
            free_socket(accept_ctx);
            *socket = CY_SOCKET_INVALID_HANDLE;

            cy_rtos_set_mutex(&ctx->socket_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

            return TLS_TO_CY_SECURE_SOCKETS_ERR(ret);
        }
        
        ret = cy_tls_connect(accept_ctx->tls_ctx, CY_TLS_ENDPOINT_SERVER, 0);
        if(ret != CY_RSLT_SUCCESS)
        {
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_tls_connect failed with error %lu\n", ret);
            cy_tls_delete_context(accept_ctx->tls_ctx);
            netconn_close(accept_ctx->conn_handler);
            netconn_delete(accept_ctx->conn_handler);
            free_socket(accept_ctx);
            *socket = CY_SOCKET_INVALID_HANDLE;

            cy_rtos_set_mutex(&ctx->socket_mutex);
            ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

            return TLS_TO_CY_SECURE_SOCKETS_ERR(ret);
        }
        accept_ctx->status |=  SOCKET_STATUS_FLAG_SECURED;
        ctx->data_received = 0;
    }

    /*
     * If disconnect event occurred and disconnect callback is registered then queue the disconnect event to worker thread.
     */
    if(disconnectevent)
    {
        if(accept_ctx->callbacks.disconnect.callback)
        {
            result = cy_worker_thread_enqueue(&socket_worker, cy_process_connect_disconnect_notification_event, (void *)accept_ctx->conn_handler);
            if(result != CY_RSLT_SUCCESS)
            {
                ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_defer_work failed at file: %s line: %d with error: 0x%lx\r\n", __FILE__, __LINE__, result);
                /*
                 * Do not fail cy_socket_accept if cy_worker_thread_enqueue fails. In-case there are receive events then returning fail from here
                 * will mislead application not to receive the data that is available to read.
                 */
            }
        }
        else
        {
            accept_ctx->disconnect_event_cache = true;
        }
    }

    cy_rtos_set_mutex(&ctx->socket_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_accept End\r\n");
    return CY_RSLT_SUCCESS;
}

