StanKarpikov/murata-2fy-stm32h7-minimal-project/Middlewares/Third_Party/Infineon_Wireless_Connectivity/secure-sockets/source/COMPONENT_LWIP/cy_secure_sockets.c
cy_rslt_t cy_socket_shutdown(cy_socket_t handle, int how)
{
    uint8_t shut_rx = 0, shut_tx = 0;
    cy_socket_ctx_t * ctx;
    err_t result;

    if(CY_SOCKET_INVALID_HANDLE == handle)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    ctx = (cy_socket_ctx_t *) handle;

    if(!is_socket_valid(ctx))
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "invalid handle\r\n");
        return CY_RSLT_MODULE_SECURE_SOCKETS_INVALID_SOCKET;
    }

    /* While this function is running, application may delete the socket. Protect entire function with a mutex. */
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex locked %s %d\r\n", __FILE__, __LINE__);
    cy_rtos_get_mutex(&ctx->socket_mutex, CY_RTOS_NEVER_TIMEOUT);

    if(NETCONNTYPE_GROUP(netconn_type(ctx->conn_handler)) != NETCONN_TCP)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_socket_shutdown call not applicable for UDP \r\n");

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return CY_RSLT_MODULE_SECURE_SOCKETS_BADARG;
    }

    if((how & CY_SOCKET_SHUT_RD) == CY_SOCKET_SHUT_RD)
    {
        shut_rx = 1;
    }

    if((how & CY_SOCKET_SHUT_WR) == CY_SOCKET_SHUT_WR)
    {
        shut_tx = 1;
    }

    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_socket_shutdown API with RX: [%d] and TX: [%d] \r\n", shut_rx, shut_tx);

    /* Call wifi-mw-core network activity function to resume the network stack. */
    cy_network_activity_notify(CY_NETWORK_ACTIVITY_TX);

    result = netconn_shutdown(ctx->conn_handler, shut_rx, shut_tx);
    if(result != ERR_OK)
    {
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "netconn shutdown API failed\r\n");

        cy_rtos_set_mutex(&ctx->socket_mutex);
        ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

        return LWIP_TO_CY_SECURE_SOCKETS_ERR(result);
    }

    cy_rtos_set_mutex(&ctx->socket_mutex);
    ss_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "socket_mutex unlocked %s %d\n", __FILE__, __LINE__);

    return CY_RSLT_SUCCESS;
}
